{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 126,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "BertNormalizer",
    "clean_text": true,
    "handle_chinese_chars": true,
    "strip_accents": false,
    "lowercase": false
  },
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Whitespace"
      },
      {
        "type": "Split",
        "pattern": {
          "Regex": "."
        },
        "behavior": "Isolated",
        "invert": false
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "<unused0>": 5,
      "<unused1>": 6,
      "<unused2>": 7,
      "<unused3>": 8,
      "<unused4>": 9,
      "<unused5>": 10,
      "<unused6>": 11,
      "<unused7>": 12,
      "<unused8>": 13,
      "<unused9>": 14,
      "!": 15,
      "\"": 16,
      "#": 17,
      "$": 18,
      "%": 19,
      "&": 20,
      "'": 21,
      "(": 22,
      ")": 23,
      "*": 24,
      "+": 25,
      ",": 26,
      "-": 27,
      ".": 28,
      "/": 29,
      "0": 30,
      "1": 31,
      "2": 32,
      "3": 33,
      "4": 34,
      "5": 35,
      "6": 36,
      "7": 37,
      "8": 38,
      "9": 39,
      ":": 40,
      ";": 41,
      "<": 42,
      "=": 43,
      ">": 44,
      "?": 45,
      "@": 46,
      "A": 47,
      "B": 48,
      "C": 49,
      "D": 50,
      "E": 51,
      "F": 52,
      "G": 53,
      "H": 54,
      "I": 55,
      "J": 56,
      "K": 57,
      "L": 58,
      "M": 59,
      "N": 60,
      "O": 61,
      "P": 62,
      "Q": 63,
      "R": 64,
      "S": 65,
      "T": 66,
      "U": 67,
      "V": 68,
      "W": 69,
      "X": 70,
      "Y": 71,
      "Z": 72,
      "[": 73,
      "\\": 74,
      "]": 75,
      "^": 76,
      "_": 77,
      "`": 78,
      "a": 79,
      "b": 80,
      "c": 81,
      "d": 82,
      "e": 83,
      "f": 84,
      "g": 85,
      "h": 86,
      "i": 87,
      "j": 88,
      "k": 89,
      "l": 90,
      "m": 91,
      "n": 92,
      "o": 93,
      "p": 94,
      "q": 95,
      "r": 96,
      "s": 97,
      "t": 98,
      "u": 99,
      "v": 100,
      "w": 101,
      "x": 102,
      "y": 103,
      "z": 104,
      "{": 105,
      "|": 106,
      "}": 107,
      "~": 108,
      "¡": 109,
      "¢": 110,
      "£": 111,
      "¥": 112,
      "§": 113,
      "¨": 114,
      "©": 115,
      "«": 116,
      "¬": 117,
      "®": 118,
      "°": 119,
      "±": 120,
      "´": 121,
      "¶": 122,
      "·": 123,
      "»": 124,
      "¼": 125,
      "½": 126,
      "¾": 127,
      "¿": 128,
      "À": 129,
      "Á": 130,
      "Â": 131,
      "Ä": 132,
      "Å": 133,
      "Æ": 134,
      "Ç": 135,
      "È": 136,
      "É": 137,
      "Ê": 138,
      "Í": 139,
      "Î": 140,
      "Ó": 141,
      "Ô": 142,
      "Ö": 143,
      "×": 144,
      "Ø": 145,
      "Ú": 146,
      "Û": 147,
      "Ü": 148,
      "Þ": 149,
      "ß": 150,
      "à": 151,
      "á": 152,
      "â": 153,
      "ã": 154,
      "ä": 155,
      "å": 156,
      "æ": 157,
      "ç": 158,
      "è": 159,
      "é": 160,
      "ê": 161,
      "ë": 162,
      "ì": 163,
      "í": 164,
      "î": 165,
      "ï": 166,
      "ð": 167,
      "ñ": 168,
      "ò": 169,
      "ó": 170,
      "ô": 171,
      "õ": 172,
      "ö": 173,
      "÷": 174,
      "ø": 175,
      "ù": 176,
      "ú": 177,
      "û": 178,
      "ü": 179,
      "ý": 180,
      "þ": 181,
      "ÿ": 182,
      "Ā": 183,
      "ā": 184,
      "ă": 185,
      "ą": 186,
      "Ć": 187,
      "ć": 188,
      "Č": 189,
      "č": 190,
      "Đ": 191,
      "đ": 192,
      "ē": 193,
      "ĕ": 194,
      "ė": 195,
      "ę": 196,
      "ě": 197,
      "ĝ": 198,
      "ğ": 199,
      "ħ": 200,
      "ĩ": 201,
      "Ī": 202,
      "ī": 203,
      "İ": 204,
      "ı": 205,
      "Ł": 206,
      "ł": 207,
      "ń": 208,
      "ň": 209,
      "ŋ": 210,
      "Ō": 211,
      "ō": 212,
      "ŏ": 213,
      "ő": 214,
      "Œ": 215,
      "œ": 216,
      "ř": 217,
      "Ś": 218,
      "ś": 219,
      "Ş": 220,
      "ş": 221,
      "Š": 222,
      "š": 223,
      "ţ": 224,
      "ť": 225,
      "ũ": 226,
      "ū": 227,
      "ŭ": 228,
      "ů": 229,
      "ź": 230,
      "Ż": 231,
      "ż": 232,
      "Ž": 233,
      "ž": 234,
      "ơ": 235,
      "ư": 236,
      "ǁ": 237,
      "ǎ": 238,
      "ǐ": 239,
      "ǒ": 240,
      "ǔ": 241,
      "ǰ": 242,
      "ș": 243,
      "ȝ": 244,
      "ɐ": 245,
      "ɑ": 246,
      "ɒ": 247,
      "ɔ": 248,
      "ɕ": 249,
      "ə": 250,
      "ɛ": 251,
      "ɟ": 252,
      "ɡ": 253,
      "ɣ": 254,
      "ɦ": 255,
      "ɨ": 256,
      "ɪ": 257,
      "ɫ": 258,
      "ɯ": 259,
      "ɲ": 260,
      "ɴ": 261,
      "ɸ": 262,
      "ɹ": 263,
      "ɾ": 264,
      "ʁ": 265,
      "ʃ": 266,
      "ʊ": 267,
      "ʌ": 268,
      "ʎ": 269,
      "ʏ": 270,
      "ʑ": 271,
      "ʒ": 272,
      "ʔ": 273,
      "ʕ": 274,
      "ʧ": 275,
      "ʻ": 276,
      "ʼ": 277,
      "ʿ": 278,
      "ˀ": 279,
      "ˈ": 280,
      "ˌ": 281,
      "ː": 282,
      "́": 283,
      "̃": 284,
      "̈": 285,
      "̓": 286,
      "̝": 287,
      "̥": 288,
      "̩": 289,
      "̯": 290,
      "͡": 291,
      "Ά": 292,
      "Α": 293,
      "Β": 294,
      "Γ": 295,
      "Δ": 296,
      "Ε": 297,
      "Ζ": 298,
      "Η": 299,
      "Θ": 300,
      "Ι": 301,
      "Κ": 302,
      "Λ": 303,
      "Μ": 304,
      "Ν": 305,
      "Ξ": 306,
      "Ο": 307,
      "Π": 308,
      "Ρ": 309,
      "Σ": 310,
      "Τ": 311,
      "Υ": 312,
      "Φ": 313,
      "Χ": 314,
      "Ψ": 315,
      "Ω": 316,
      "ά": 317,
      "έ": 318,
      "ή": 319,
      "ί": 320,
      "α": 321,
      "β": 322,
      "γ": 323,
      "δ": 324,
      "ε": 325,
      "ζ": 326,
      "η": 327,
      "θ": 328,
      "ι": 329,
      "κ": 330,
      "λ": 331,
      "μ": 332,
      "ν": 333,
      "ξ": 334,
      "ο": 335,
      "π": 336,
      "ρ": 337,
      "ς": 338,
      "σ": 339,
      "τ": 340,
      "υ": 341,
      "φ": 342,
      "χ": 343,
      "ψ": 344,
      "ω": 345,
      "ό": 346,
      "ύ": 347,
      "ώ": 348,
      "Ё": 349,
      "І": 350,
      "Ј": 351,
      "А": 352,
      "Б": 353,
      "В": 354,
      "Г": 355,
      "Д": 356,
      "Е": 357,
      "Ж": 358,
      "З": 359,
      "И": 360,
      "Й": 361,
      "К": 362,
      "Л": 363,
      "М": 364,
      "Н": 365,
      "О": 366,
      "П": 367,
      "Р": 368,
      "С": 369,
      "Т": 370,
      "У": 371,
      "Ф": 372,
      "Х": 373,
      "Ц": 374,
      "Ч": 375,
      "Ш": 376,
      "Ы": 377,
      "Ь": 378,
      "Э": 379,
      "Ю": 380,
      "Я": 381,
      "а": 382,
      "б": 383,
      "в": 384,
      "г": 385,
      "д": 386,
      "е": 387,
      "ж": 388,
      "з": 389,
      "и": 390,
      "й": 391,
      "к": 392,
      "л": 393,
      "м": 394,
      "н": 395,
      "о": 396,
      "п": 397,
      "р": 398,
      "с": 399,
      "т": 400,
      "у": 401,
      "ф": 402,
      "х": 403,
      "ц": 404,
      "ч": 405,
      "ш": 406,
      "щ": 407,
      "ъ": 408,
      "ы": 409,
      "ь": 410,
      "э": 411,
      "ю": 412,
      "я": 413,
      "ё": 414,
      "і": 415,
      "ї": 416,
      "ј": 417,
      "њ": 418,
      "ћ": 419,
      "қ": 420,
      "ү": 421,
      "ө": 422,
      "Ա": 423,
      "ա": 424,
      "գ": 425,
      "ե": 426,
      "ի": 427,
      "յ": 428,
      "ն": 429,
      "ո": 430,
      "տ": 431,
      "ր": 432,
      "ւ": 433,
      "ְ": 434,
      "ִ": 435,
      "ֵ": 436,
      "ֶ": 437,
      "ַ": 438,
      "ָ": 439,
      "ֹ": 440,
      "ּ": 441,
      "ׁ": 442,
      "א": 443,
      "ב": 444,
      "ג": 445,
      "ד": 446,
      "ה": 447,
      "ו": 448,
      "ז": 449,
      "ח": 450,
      "ט": 451,
      "י": 452,
      "כ": 453,
      "ל": 454,
      "ם": 455,
      "מ": 456,
      "ן": 457,
      "נ": 458,
      "ס": 459,
      "ע": 460,
      "פ": 461,
      "צ": 462,
      "ק": 463,
      "ר": 464,
      "ש": 465,
      "ת": 466,
      "،": 467,
      "ء": 468,
      "آ": 469,
      "أ": 470,
      "إ": 471,
      "ئ": 472,
      "ا": 473,
      "ب": 474,
      "ة": 475,
      "ت": 476,
      "ث": 477,
      "ج": 478,
      "ح": 479,
      "خ": 480,
      "د": 481,
      "ر": 482,
      "ز": 483,
      "س": 484,
      "ش": 485,
      "ص": 486,
      "ض": 487,
      "ط": 488,
      "ظ": 489,
      "ع": 490,
      "غ": 491,
      "ـ": 492,
      "ف": 493,
      "ق": 494,
      "ك": 495,
      "ل": 496,
      "م": 497,
      "ن": 498,
      "ه": 499,
      "و": 500,
      "ى": 501,
      "ي": 502,
      "َ": 503,
      "ِ": 504,
      "ْ": 505,
      "پ": 506,
      "چ": 507,
      "ک": 508,
      "گ": 509,
      "ھ": 510,
      "ہ": 511,
      "ی": 512,
      "ە": 513,
      "ं": 514,
      "अ": 515,
      "क": 516,
      "ख": 517,
      "ग": 518,
      "च": 519,
      "ज": 520,
      "ट": 521,
      "ड": 522,
      "ण": 523,
      "त": 524,
      "द": 525,
      "ध": 526,
      "न": 527,
      "प": 528,
      "ब": 529,
      "भ": 530,
      "म": 531,
      "य": 532,
      "र": 533,
      "ल": 534,
      "व": 535,
      "श": 536,
      "स": 537,
      "ह": 538,
      "़": 539,
      "ा": 540,
      "ि": 541,
      "ी": 542,
      "ु": 543,
      "ू": 544,
      "े": 545,
      "ो": 546,
      "्": 547,
      "ম": 548,
      "র": 549,
      "া": 550,
      "ু": 551,
      "্": 552,
      "அ": 553,
      "க": 554,
      "ச": 555,
      "ட": 556,
      "த": 557,
      "ன": 558,
      "ப": 559,
      "ம": 560,
      "ய": 561,
      "ர": 562,
      "ற": 563,
      "ல": 564,
      "ழ": 565,
      "வ": 566,
      "ா": 567,
      "ி": 568,
      "ு": 569,
      "ை": 570,
      "்": 571,
      "ర": 572,
      "ರ": 573,
      "ು": 574,
      "ി": 575,
      "്": 576,
      "ක": 577,
      "ත": 578,
      "ද": 579,
      "න": 580,
      "ප": 581,
      "ම": 582,
      "ය": 583,
      "ර": 584,
      "ව": 585,
      "ස": 586,
      "්": 587,
      "ා": 588,
      "ි": 589,
      "ු": 590,
      "ก": 591,
      "ข": 592,
      "ค": 593,
      "ง": 594,
      "จ": 595,
      "ช": 596,
      "ญ": 597,
      "ณ": 598,
      "ด": 599,
      "ต": 600,
      "ถ": 601,
      "ท": 602,
      "ธ": 603,
      "น": 604,
      "บ": 605,
      "ป": 606,
      "ผ": 607,
      "พ": 608,
      "ฟ": 609,
      "ภ": 610,
      "ม": 611,
      "ย": 612,
      "ร": 613,
      "ล": 614,
      "ว": 615,
      "ศ": 616,
      "ส": 617,
      "ห": 618,
      "อ": 619,
      "ะ": 620,
      "ั": 621,
      "า": 622,
      "ิ": 623,
      "ี": 624,
      "ื": 625,
      "ุ": 626,
      "ู": 627,
      "เ": 628,
      "แ": 629,
      "โ": 630,
      "ไ": 631,
      "็": 632,
      "่": 633,
      "้": 634,
      "์": 635,
      "ํ": 636,
      "ດ": 637,
      "ນ": 638,
      "ປ": 639,
      "ວ": 640,
      "ສ": 641,
      "ະ": 642,
      "າ": 643,
      "ເ": 644,
      "་": 645,
      "ག": 646,
      "ང": 647,
      "ད": 648,
      "ན": 649,
      "བ": 650,
      "མ": 651,
      "ར": 652,
      "ལ": 653,
      "ས": 654,
      "ི": 655,
      "ོ": 656,
      "ླ": 657,
      "က": 658,
      "င": 659,
      "တ": 660,
      "န": 661,
      "ပ": 662,
      "ရ": 663,
      "ာ": 664,
      "ိ": 665,
      "ု": 666,
      "ေ": 667,
      "း": 668,
      "်": 669,
      "ြ": 670,
      "ა": 671,
      "ბ": 672,
      "გ": 673,
      "დ": 674,
      "ე": 675,
      "ვ": 676,
      "თ": 677,
      "ი": 678,
      "ლ": 679,
      "მ": 680,
      "ნ": 681,
      "ო": 682,
      "რ": 683,
      "ს": 684,
      "ტ": 685,
      "უ": 686,
      "ქ": 687,
      "ყ": 688,
      "წ": 689,
      "ᄇ": 690,
      "ᅵ": 691,
      "አ": 692,
      "ក": 693,
      "ង": 694,
      "ត": 695,
      "ន": 696,
      "ព": 697,
      "រ": 698,
      "ា": 699,
      "្": 700,
      "ᠠ": 701,
      "ᠡ": 702,
      "ᠢ": 703,
      "ᠣ": 704,
      "ᠤ": 705,
      "ᠨ": 706,
      "ᠩ": 707,
      "ᠪ": 708,
      "ᠭ": 709,
      "ᠮ": 710,
      "ᠯ": 711,
      "ᠷ": 712,
      "ᡝ": 713,
      "ᡞ": 714,
      "ᡠ": 715,
      "ᡥ": 716,
      "ḍ": 717,
      "Ḥ": 718,
      "ḥ": 719,
      "ḫ": 720,
      "ṃ": 721,
      "ṅ": 722,
      "ṇ": 723,
      "ṛ": 724,
      "ṣ": 725,
      "ṭ": 726,
      "ạ": 727,
      "ả": 728,
      "ấ": 729,
      "ầ": 730,
      "ế": 731,
      "ề": 732,
      "ệ": 733,
      "ị": 734,
      "ố": 735,
      "ồ": 736,
      "ộ": 737,
      "ờ": 738,
      "ụ": 739,
      "ἀ": 740,
      "Ἀ": 741,
      "ἐ": 742,
      "Ἑ": 743,
      "ἰ": 744,
      "ὁ": 745,
      "ὰ": 746,
      "ά": 747,
      "ὲ": 748,
      "έ": 749,
      "ὶ": 750,
      "ῖ": 751,
      "‐": 752,
      "–": 753,
      "—": 754,
      "―": 755,
      "‖": 756,
      "‘": 757,
      "’": 758,
      "“": 759,
      "”": 760,
      "„": 761,
      "†": 762,
      "‡": 763,
      "•": 764,
      "‥": 765,
      "…": 766,
      "‧": 767,
      "‰": 768,
      "′": 769,
      "″": 770,
      "※": 771,
      "‼": 772,
      "⁂": 773,
      "⁄": 774,
      "⁇": 775,
      "⁈": 776,
      "⁉": 777,
      "℃": 778,
      "ℓ": 779,
      "Å": 780,
      "ℵ": 781,
      "⅓": 782,
      "⅔": 783,
      "Ⅰ": 784,
      "Ⅱ": 785,
      "Ⅲ": 786,
      "Ⅳ": 787,
      "Ⅴ": 788,
      "Ⅵ": 789,
      "Ⅶ": 790,
      "Ⅷ": 791,
      "Ⅸ": 792,
      "Ⅹ": 793,
      "Ⅺ": 794,
      "Ⅻ": 795,
      "ⅰ": 796,
      "ⅱ": 797,
      "ⅳ": 798,
      "ⅴ": 799,
      "ⅵ": 800,
      "ⅸ": 801,
      "ⅹ": 802,
      "ⅺ": 803,
      "←": 804,
      "↑": 805,
      "→": 806,
      "↓": 807,
      "↘": 808,
      "↦": 809,
      "⇒": 810,
      "⇔": 811,
      "∀": 812,
      "∂": 813,
      "∃": 814,
      "∈": 815,
      "∑": 816,
      "−": 817,
      "∖": 818,
      "∗": 819,
      "√": 820,
      "∞": 821,
      "∠": 822,
      "∥": 823,
      "∧": 824,
      "∨": 825,
      "∩": 826,
      "∪": 827,
      "∴": 828,
      "∽": 829,
      "≈": 830,
      "≒": 831,
      "≠": 832,
      "≡": 833,
      "≤": 834,
      "≥": 835,
      "≦": 836,
      "≧": 837,
      "≪": 838,
      "≫": 839,
      "⊂": 840,
      "⊆": 841,
      "⊗": 842,
      "⊿": 843,
      "⋅": 844,
      "⋯": 845,
      "⌒": 846,
      "①": 847,
      "②": 848,
      "③": 849,
      "④": 850,
      "⑤": 851,
      "⑥": 852,
      "⑦": 853,
      "⑧": 854,
      "⑨": 855,
      "⑩": 856,
      "⑪": 857,
      "⑫": 858,
      "⑬": 859,
      "⑭": 860,
      "⑮": 861,
      "⑯": 862,
      "⑰": 863,
      "⑱": 864,
      "⑲": 865,
      "⑳": 866,
      "ⓐ": 867,
      "ⓑ": 868,
      "ⓒ": 869,
      "ⓓ": 870,
      "─": 871,
      "━": 872,
      "│": 873,
      "┃": 874,
      "┌": 875,
      "┏": 876,
      "┐": 877,
      "┓": 878,
      "└": 879,
      "┗": 880,
      "┘": 881,
      "┛": 882,
      "├": 883,
      "┠": 884,
      "┣": 885,
      "┤": 886,
      "┨": 887,
      "┬": 888,
      "┯": 889,
      "┳": 890,
      "┴": 891,
      "┷": 892,
      "┼": 893,
      "█": 894,
      "■": 895,
      "□": 896,
      "▲": 897,
      "△": 898,
      "▶": 899,
      "▼": 900,
      "▽": 901,
      "◆": 902,
      "◇": 903,
      "◉": 904,
      "○": 905,
      "◎": 906,
      "●": 907,
      "◦": 908,
      "◯": 909,
      "★": 910,
      "☆": 911,
      "☉": 912,
      "☞": 913,
      "♀": 914,
      "♂": 915,
      "♠": 916,
      "♡": 917,
      "♣": 918,
      "♥": 919,
      "♦": 920,
      "♩": 921,
      "♪": 922,
      "♭": 923,
      "♯": 924,
      "✓": 925,
      "✩": 926,
      "❷": 927,
      "❸": 928,
      "❹": 929,
      "⟨": 930,
      "⟩": 931,
      "⦿": 932,
      "ⴰ": 933,
      "　": 934,
      "、": 935,
      "。": 936,
      "〃": 937,
      "々": 938,
      "〆": 939,
      "〇": 940,
      "〈": 941,
      "〉": 942,
      "《": 943,
      "》": 944,
      "「": 945,
      "」": 946,
      "『": 947,
      "』": 948,
      "【": 949,
      "】": 950,
      "〒": 951,
      "〓": 952,
      "〔": 953,
      "〕": 954,
      "〜": 955,
      "〝": 956,
      "〟": 957,
      "〰": 958,
      "〻": 959,
      "〼": 960,
      "〽": 961,
      "ぁ": 962,
      "あ": 963,
      "ぃ": 964,
      "い": 965,
      "ぅ": 966,
      "う": 967,
      "ぇ": 968,
      "え": 969,
      "ぉ": 970,
      "お": 971,
      "か": 972,
      "が": 973,
      "き": 974,
      "ぎ": 975,
      "く": 976,
      "ぐ": 977,
      "け": 978,
      "げ": 979,
      "こ": 980,
      "ご": 981,
      "さ": 982,
      "ざ": 983,
      "し": 984,
      "じ": 985,
      "す": 986,
      "ず": 987,
      "せ": 988,
      "ぜ": 989,
      "そ": 990,
      "ぞ": 991,
      "た": 992,
      "だ": 993,
      "ち": 994,
      "ぢ": 995,
      "っ": 996,
      "つ": 997,
      "づ": 998,
      "て": 999,
      "で": 1000,
      "と": 1001,
      "ど": 1002,
      "な": 1003,
      "に": 1004,
      "ぬ": 1005,
      "ね": 1006,
      "の": 1007,
      "は": 1008,
      "ば": 1009,
      "ぱ": 1010,
      "ひ": 1011,
      "び": 1012,
      "ぴ": 1013,
      "ふ": 1014,
      "ぶ": 1015,
      "ぷ": 1016,
      "へ": 1017,
      "べ": 1018,
      "ぺ": 1019,
      "ほ": 1020,
      "ぼ": 1021,
      "ぽ": 1022,
      "ま": 1023,
      "み": 1024,
      "む": 1025,
      "め": 1026,
      "も": 1027,
      "ゃ": 1028,
      "や": 1029,
      "ゅ": 1030,
      "ゆ": 1031,
      "ょ": 1032,
      "よ": 1033,
      "ら": 1034,
      "り": 1035,
      "る": 1036,
      "れ": 1037,
      "ろ": 1038,
      "ゎ": 1039,
      "わ": 1040,
      "ゐ": 1041,
      "ゑ": 1042,
      "を": 1043,
      "ん": 1044,
      "ゔ": 1045,
      "゙": 1046,
      "゚": 1047,
      "゛": 1048,
      "゜": 1049,
      "ゝ": 1050,
      "ゞ": 1051,
      "ゟ": 1052,
      "゠": 1053,
      "ァ": 1054,
      "ア": 1055,
      "ィ": 1056,
      "イ": 1057,
      "ゥ": 1058,
      "ウ": 1059,
      "ェ": 1060,
      "エ": 1061,
      "ォ": 1062,
      "オ": 1063,
      "カ": 1064,
      "ガ": 1065,
      "キ": 1066,
      "ギ": 1067,
      "ク": 1068,
      "グ": 1069,
      "ケ": 1070,
      "ゲ": 1071,
      "コ": 1072,
      "ゴ": 1073,
      "サ": 1074,
      "ザ": 1075,
      "シ": 1076,
      "ジ": 1077,
      "ス": 1078,
      "ズ": 1079,
      "セ": 1080,
      "ゼ": 1081,
      "ソ": 1082,
      "ゾ": 1083,
      "タ": 1084,
      "ダ": 1085,
      "チ": 1086,
      "ヂ": 1087,
      "ッ": 1088,
      "ツ": 1089,
      "ヅ": 1090,
      "テ": 1091,
      "デ": 1092,
      "ト": 1093,
      "ド": 1094,
      "ナ": 1095,
      "ニ": 1096,
      "ヌ": 1097,
      "ネ": 1098,
      "ノ": 1099,
      "ハ": 1100,
      "バ": 1101,
      "パ": 1102,
      "ヒ": 1103,
      "ビ": 1104,
      "ピ": 1105,
      "フ": 1106,
      "ブ": 1107,
      "プ": 1108,
      "ヘ": 1109,
      "ベ": 1110,
      "ペ": 1111,
      "ホ": 1112,
      "ボ": 1113,
      "ポ": 1114,
      "マ": 1115,
      "ミ": 1116,
      "ム": 1117,
      "メ": 1118,
      "モ": 1119,
      "ャ": 1120,
      "ヤ": 1121,
      "ュ": 1122,
      "ユ": 1123,
      "ョ": 1124,
      "ヨ": 1125,
      "ラ": 1126,
      "リ": 1127,
      "ル": 1128,
      "レ": 1129,
      "ロ": 1130,
      "ヮ": 1131,
      "ワ": 1132,
      "ヰ": 1133,
      "ヱ": 1134,
      "ヲ": 1135,
      "ン": 1136,
      "ヴ": 1137,
      "ヵ": 1138,
      "ヶ": 1139,
      "ヷ": 1140,
      "ヸ": 1141,
      "ヹ": 1142,
      "ヺ": 1143,
      "・": 1144,
      "ー": 1145,
      "ヽ": 1146,
      "ヾ": 1147,
      "ヿ": 1148,
      "㆑": 1149,
      "ㇰ": 1150,
      "ㇱ": 1151,
      "ㇲ": 1152,
      "ㇳ": 1153,
      "ㇴ": 1154,
      "ㇵ": 1155,
      "ㇶ": 1156,
      "ㇷ": 1157,
      "ㇸ": 1158,
      "ㇹ": 1159,
      "ㇺ": 1160,
      "ㇻ": 1161,
      "ㇼ": 1162,
      "ㇽ": 1163,
      "ㇿ": 1164,
      "㉑": 1165,
      "㉒": 1166,
      "㋚": 1167,
      "㋜": 1168,
      "㋡": 1169,
      "㏄": 1170,
      "㒵": 1171,
      "㔟": 1172,
      "㕝": 1173,
      "㕞": 1174,
      "㕮": 1175,
      "㗅": 1176,
      "㘅": 1177,
      "㝫": 1178,
      "㝵": 1179,
      "㟽": 1180,
      "㡡": 1181,
      "㩮": 1182,
      "㩳": 1183,
      "㮈": 1184,
      "㮶": 1185,
      "㰏": 1186,
      "㷀": 1187,
      "㷔": 1188,
      "㸅": 1189,
      "㹠": 1190,
      "䇳": 1191,
      "䏰": 1192,
      "䑛": 1193,
      "䒾": 1194,
      "䔥": 1195,
      "䕃": 1196,
      "䖝": 1197,
      "䘏": 1198,
      "䟽": 1199,
      "䠖": 1200,
      "䢵": 1201,
      "䬻": 1202,
      "䰗": 1203,
      "一": 1204,
      "丁": 1205,
      "七": 1206,
      "万": 1207,
      "丈": 1208,
      "三": 1209,
      "上": 1210,
      "下": 1211,
      "不": 1212,
      "与": 1213,
      "丏": 1214,
      "丐": 1215,
      "丑": 1216,
      "且": 1217,
      "丕": 1218,
      "世": 1219,
      "丗": 1220,
      "丘": 1221,
      "丙": 1222,
      "东": 1223,
      "丞": 1224,
      "両": 1225,
      "並": 1226,
      "丨": 1227,
      "个": 1228,
      "丫": 1229,
      "中": 1230,
      "丯": 1231,
      "丰": 1232,
      "丱": 1233,
      "串": 1234,
      "丶": 1235,
      "丸": 1236,
      "丹": 1237,
      "主": 1238,
      "丼": 1239,
      "丿": 1240,
      "乀": 1241,
      "乂": 1242,
      "乃": 1243,
      "久": 1244,
      "么": 1245,
      "之": 1246,
      "乍": 1247,
      "乎": 1248,
      "乏": 1249,
      "乐": 1250,
      "乕": 1251,
      "乖": 1252,
      "乗": 1253,
      "乘": 1254,
      "乙": 1255,
      "九": 1256,
      "乞": 1257,
      "也": 1258,
      "乢": 1259,
      "乭": 1260,
      "乱": 1261,
      "乳": 1262,
      "乾": 1263,
      "亀": 1264,
      "亂": 1265,
      "亅": 1266,
      "了": 1267,
      "予": 1268,
      "争": 1269,
      "事": 1270,
      "二": 1271,
      "亍": 1272,
      "于": 1273,
      "云": 1274,
      "互": 1275,
      "五": 1276,
      "井": 1277,
      "亘": 1278,
      "亙": 1279,
      "些": 1280,
      "亜": 1281,
      "亞": 1282,
      "亟": 1283,
      "亠": 1284,
      "亡": 1285,
      "亢": 1286,
      "交": 1287,
      "亥": 1288,
      "亦": 1289,
      "亨": 1290,
      "享": 1291,
      "京": 1292,
      "亭": 1293,
      "亮": 1294,
      "亳": 1295,
      "亶": 1296,
      "亹": 1297,
      "人": 1298,
      "亻": 1299,
      "什": 1300,
      "仁": 1301,
      "仂": 1302,
      "仄": 1303,
      "仆": 1304,
      "仇": 1305,
      "今": 1306,
      "介": 1307,
      "仍": 1308,
      "从": 1309,
      "仏": 1310,
      "仔": 1311,
      "仕": 1312,
      "他": 1313,
      "仗": 1314,
      "付": 1315,
      "仙": 1316,
      "仝": 1317,
      "仞": 1318,
      "仟": 1319,
      "仡": 1320,
      "代": 1321,
      "令": 1322,
      "以": 1323,
      "仭": 1324,
      "仮": 1325,
      "仰": 1326,
      "仲": 1327,
      "件": 1328,
      "价": 1329,
      "任": 1330,
      "份": 1331,
      "仿": 1332,
      "企": 1333,
      "伃": 1334,
      "伉": 1335,
      "伊": 1336,
      "伍": 1337,
      "伎": 1338,
      "伏": 1339,
      "伐": 1340,
      "休": 1341,
      "会": 1342,
      "伜": 1343,
      "伝": 1344,
      "伯": 1345,
      "估": 1346,
      "伴": 1347,
      "伶": 1348,
      "伷": 1349,
      "伸": 1350,
      "伺": 1351,
      "似": 1352,
      "伽": 1353,
      "佃": 1354,
      "但": 1355,
      "佇": 1356,
      "佈": 1357,
      "佉": 1358,
      "位": 1359,
      "低": 1360,
      "住": 1361,
      "佐": 1362,
      "佑": 1363,
      "体": 1364,
      "佔": 1365,
      "何": 1366,
      "佗": 1367,
      "余": 1368,
      "佚": 1369,
      "佛": 1370,
      "作": 1371,
      "佝": 1372,
      "佞": 1373,
      "佟": 1374,
      "你": 1375,
      "佩": 1376,
      "佪": 1377,
      "佬": 1378,
      "佯": 1379,
      "佰": 1380,
      "佳": 1381,
      "併": 1382,
      "佶": 1383,
      "佺": 1384,
      "佻": 1385,
      "佼": 1386,
      "佽": 1387,
      "佾": 1388,
      "使": 1389,
      "侂": 1390,
      "侃": 1391,
      "來": 1392,
      "侈": 1393,
      "例": 1394,
      "侍": 1395,
      "侏": 1396,
      "侑": 1397,
      "侔": 1398,
      "侖": 1399,
      "侗": 1400,
      "侘": 1401,
      "供": 1402,
      "依": 1403,
      "侠": 1404,
      "価": 1405,
      "侫": 1406,
      "侭": 1407,
      "侮": 1408,
      "侯": 1409,
      "侵": 1410,
      "侶": 1411,
      "便": 1412,
      "俀": 1413,
      "係": 1414,
      "促": 1415,
      "俄": 1416,
      "俅": 1417,
      "俊": 1418,
      "俎": 1419,
      "俏": 1420,
      "俐": 1421,
      "俑": 1422,
      "俗": 1423,
      "俘": 1424,
      "俚": 1425,
      "俛": 1426,
      "保": 1427,
      "俟": 1428,
      "俠": 1429,
      "信": 1430,
      "俣": 1431,
      "俤": 1432,
      "俥": 1433,
      "修": 1434,
      "俯": 1435,
      "俱": 1436,
      "俳": 1437,
      "俵": 1438,
      "俶": 1439,
      "俸": 1440,
      "俺": 1441,
      "俾": 1442,
      "倀": 1443,
      "倅": 1444,
      "倆": 1445,
      "倉": 1446,
      "個": 1447,
      "倍": 1448,
      "倏": 1449,
      "倐": 1450,
      "們": 1451,
      "倒": 1452,
      "倔": 1453,
      "倖": 1454,
      "倘": 1455,
      "候": 1456,
      "倚": 1457,
      "倜": 1458,
      "倞": 1459,
      "借": 1460,
      "倡": 1461,
      "倣": 1462,
      "値": 1463,
      "倥": 1464,
      "倦": 1465,
      "倧": 1466,
      "倨": 1467,
      "倩": 1468,
      "倪": 1469,
      "倫": 1470,
      "倬": 1471,
      "倭": 1472,
      "倮": 1473,
      "倶": 1474,
      "倹": 1475,
      "倻": 1476,
      "偁": 1477,
      "偃": 1478,
      "假": 1479,
      "偈": 1480,
      "偉": 1481,
      "偎": 1482,
      "偏": 1483,
      "偐": 1484,
      "偓": 1485,
      "偕": 1486,
      "偖": 1487,
      "做": 1488,
      "停": 1489,
      "健": 1490,
      "偪": 1491,
      "偬": 1492,
      "偲": 1493,
      "側": 1494,
      "偵": 1495,
      "偶": 1496,
      "偸": 1497,
      "偽": 1498,
      "傀": 1499,
      "傅": 1500,
      "傍": 1501,
      "傑": 1502,
      "傒": 1503,
      "傔": 1504,
      "傕": 1505,
      "傖": 1506,
      "傘": 1507,
      "備": 1508,
      "傚": 1509,
      "傪": 1510,
      "催": 1511,
      "傭": 1512,
      "傱": 1513,
      "傲": 1514,
      "傳": 1515,
      "傴": 1516,
      "債": 1517,
      "傷": 1518,
      "傾": 1519,
      "僂": 1520,
      "僄": 1521,
      "僅": 1522,
      "僇": 1523,
      "僉": 1524,
      "僊": 1525,
      "働": 1526,
      "僎": 1527,
      "像": 1528,
      "僑": 1529,
      "僕": 1530,
      "僖": 1531,
      "僚": 1532,
      "僞": 1533,
      "僣": 1534,
      "僥": 1535,
      "僦": 1536,
      "僧": 1537,
      "僩": 1538,
      "僭": 1539,
      "僮": 1540,
      "僴": 1541,
      "僵": 1542,
      "價": 1543,
      "僻": 1544,
      "儀": 1545,
      "儁": 1546,
      "儂": 1547,
      "儃": 1548,
      "億": 1549,
      "儆": 1550,
      "儈": 1551,
      "儉": 1552,
      "儋": 1553,
      "儒": 1554,
      "儔": 1555,
      "儕": 1556,
      "儗": 1557,
      "儘": 1558,
      "儚": 1559,
      "儛": 1560,
      "儞": 1561,
      "償": 1562,
      "儡": 1563,
      "優": 1564,
      "儲": 1565,
      "儵": 1566,
      "儷": 1567,
      "儺": 1568,
      "儻": 1569,
      "儼": 1570,
      "儿": 1571,
      "兀": 1572,
      "允": 1573,
      "元": 1574,
      "兄": 1575,
      "充": 1576,
      "兆": 1577,
      "兇": 1578,
      "先": 1579,
      "光": 1580,
      "克": 1581,
      "兌": 1582,
      "免": 1583,
      "兎": 1584,
      "児": 1585,
      "兒": 1586,
      "兔": 1587,
      "兕": 1588,
      "兗": 1589,
      "党": 1590,
      "兜": 1591,
      "兢": 1592,
      "入": 1593,
      "內": 1594,
      "全": 1595,
      "兩": 1596,
      "兪": 1597,
      "八": 1598,
      "公": 1599,
      "六": 1600,
      "兮": 1601,
      "共": 1602,
      "兴": 1603,
      "兵": 1604,
      "其": 1605,
      "具": 1606,
      "典": 1607,
      "兼": 1608,
      "冀": 1609,
      "冂": 1610,
      "内": 1611,
      "円": 1612,
      "冉": 1613,
      "冊": 1614,
      "册": 1615,
      "再": 1616,
      "冏": 1617,
      "冐": 1618,
      "冑": 1619,
      "冒": 1620,
      "冕": 1621,
      "冖": 1622,
      "冗": 1623,
      "写": 1624,
      "军": 1625,
      "冠": 1626,
      "冢": 1627,
      "冤": 1628,
      "冥": 1629,
      "冦": 1630,
      "冨": 1631,
      "冩": 1632,
      "冪": 1633,
      "冫": 1634,
      "冬": 1635,
      "冰": 1636,
      "冱": 1637,
      "冲": 1638,
      "决": 1639,
      "冴": 1640,
      "况": 1641,
      "冶": 1642,
      "冷": 1643,
      "冼": 1644,
      "冽": 1645,
      "凄": 1646,
      "凅": 1647,
      "准": 1648,
      "凉": 1649,
      "凋": 1650,
      "凌": 1651,
      "凍": 1652,
      "凖": 1653,
      "凛": 1654,
      "凜": 1655,
      "凝": 1656,
      "凞": 1657,
      "几": 1658,
      "凡": 1659,
      "処": 1660,
      "凧": 1661,
      "凩": 1662,
      "凪": 1663,
      "凭": 1664,
      "凮": 1665,
      "凰": 1666,
      "凱": 1667,
      "凳": 1668,
      "凴": 1669,
      "凵": 1670,
      "凶": 1671,
      "凸": 1672,
      "凹": 1673,
      "出": 1674,
      "函": 1675,
      "凾": 1676,
      "刀": 1677,
      "刁": 1678,
      "刃": 1679,
      "刄": 1680,
      "分": 1681,
      "切": 1682,
      "刈": 1683,
      "刊": 1684,
      "刋": 1685,
      "刎": 1686,
      "刑": 1687,
      "刓": 1688,
      "刔": 1689,
      "刕": 1690,
      "刖": 1691,
      "列": 1692,
      "初": 1693,
      "判": 1694,
      "別": 1695,
      "刧": 1696,
      "利": 1697,
      "刪": 1698,
      "刮": 1699,
      "到": 1700,
      "刳": 1701,
      "制": 1702,
      "刷": 1703,
      "券": 1704,
      "刹": 1705,
      "刺": 1706,
      "刻": 1707,
      "剃": 1708,
      "剄": 1709,
      "則": 1710,
      "剉": 1711,
      "削": 1712,
      "剋": 1713,
      "剌": 1714,
      "前": 1715,
      "剏": 1716,
      "剔": 1717,
      "剕": 1718,
      "剖": 1719,
      "剗": 1720,
      "剛": 1721,
      "剜": 1722,
      "剝": 1723,
      "剞": 1724,
      "剡": 1725,
      "剣": 1726,
      "剤": 1727,
      "剥": 1728,
      "剩": 1729,
      "剪": 1730,
      "副": 1731,
      "剰": 1732,
      "剱": 1733,
      "割": 1734,
      "剳": 1735,
      "剴": 1736,
      "創": 1737,
      "剽": 1738,
      "剿": 1739,
      "劂": 1740,
      "劃": 1741,
      "劄": 1742,
      "劇": 1743,
      "劈": 1744,
      "劉": 1745,
      "劍": 1746,
      "劑": 1747,
      "劒": 1748,
      "劓": 1749,
      "劔": 1750,
      "力": 1751,
      "功": 1752,
      "加": 1753,
      "劣": 1754,
      "动": 1755,
      "助": 1756,
      "努": 1757,
      "劫": 1758,
      "劬": 1759,
      "劭": 1760,
      "励": 1761,
      "労": 1762,
      "劵": 1763,
      "効": 1764,
      "劾": 1765,
      "勁": 1766,
      "勃": 1767,
      "勅": 1768,
      "勇": 1769,
      "勉": 1770,
      "勑": 1771,
      "勒": 1772,
      "動": 1773,
      "勖": 1774,
      "勗": 1775,
      "勘": 1776,
      "務": 1777,
      "勛": 1778,
      "勝": 1779,
      "勞": 1780,
      "募": 1781,
      "勢": 1782,
      "勣": 1783,
      "勤": 1784,
      "勦": 1785,
      "勧": 1786,
      "勰": 1787,
      "勲": 1788,
      "勳": 1789,
      "勵": 1790,
      "勸": 1791,
      "勹": 1792,
      "勺": 1793,
      "勾": 1794,
      "勿": 1795,
      "匀": 1796,
      "匁": 1797,
      "匂": 1798,
      "包": 1799,
      "匆": 1800,
      "匇": 1801,
      "匈": 1802,
      "匍": 1803,
      "匏": 1804,
      "匐": 1805,
      "匕": 1806,
      "化": 1807,
      "北": 1808,
      "匙": 1809,
      "匚": 1810,
      "匜": 1811,
      "匝": 1812,
      "匠": 1813,
      "匡": 1814,
      "匣": 1815,
      "匪": 1816,
      "匯": 1817,
      "匱": 1818,
      "匳": 1819,
      "匵": 1820,
      "匹": 1821,
      "区": 1822,
      "医": 1823,
      "匾": 1824,
      "匿": 1825,
      "區": 1826,
      "十": 1827,
      "千": 1828,
      "卅": 1829,
      "升": 1830,
      "午": 1831,
      "卉": 1832,
      "半": 1833,
      "卍": 1834,
      "华": 1835,
      "卑": 1836,
      "卒": 1837,
      "卓": 1838,
      "協": 1839,
      "南": 1840,
      "単": 1841,
      "博": 1842,
      "卜": 1843,
      "卞": 1844,
      "占": 1845,
      "卡": 1846,
      "卦": 1847,
      "卩": 1848,
      "卬": 1849,
      "卯": 1850,
      "印": 1851,
      "危": 1852,
      "即": 1853,
      "却": 1854,
      "卵": 1855,
      "卷": 1856,
      "卸": 1857,
      "卺": 1858,
      "卻": 1859,
      "卽": 1860,
      "卿": 1861,
      "厂": 1862,
      "厄": 1863,
      "厓": 1864,
      "厖": 1865,
      "厘": 1866,
      "厙": 1867,
      "厚": 1868,
      "厝": 1869,
      "原": 1870,
      "厠": 1871,
      "厥": 1872,
      "厦": 1873,
      "厨": 1874,
      "厩": 1875,
      "厭": 1876,
      "厮": 1877,
      "厰": 1878,
      "厲": 1879,
      "厳": 1880,
      "厴": 1881,
      "厶": 1882,
      "去": 1883,
      "参": 1884,
      "參": 1885,
      "又": 1886,
      "叉": 1887,
      "及": 1888,
      "友": 1889,
      "双": 1890,
      "反": 1891,
      "収": 1892,
      "叔": 1893,
      "叕": 1894,
      "取": 1895,
      "受": 1896,
      "叙": 1897,
      "叚": 1898,
      "叛": 1899,
      "叟": 1900,
      "叡": 1901,
      "叢": 1902,
      "口": 1903,
      "古": 1904,
      "句": 1905,
      "叨": 1906,
      "叩": 1907,
      "只": 1908,
      "叫": 1909,
      "召": 1910,
      "叭": 1911,
      "叮": 1912,
      "可": 1913,
      "台": 1914,
      "叱": 1915,
      "史": 1916,
      "右": 1917,
      "叵": 1918,
      "叶": 1919,
      "号": 1920,
      "司": 1921,
      "叺": 1922,
      "吁": 1923,
      "吃": 1924,
      "各": 1925,
      "合": 1926,
      "吉": 1927,
      "吊": 1928,
      "吋": 1929,
      "同": 1930,
      "名": 1931,
      "后": 1932,
      "吏": 1933,
      "吐": 1934,
      "向": 1935,
      "吒": 1936,
      "君": 1937,
      "吝": 1938,
      "吞": 1939,
      "吟": 1940,
      "吠": 1941,
      "否": 1942,
      "吧": 1943,
      "吨": 1944,
      "吩": 1945,
      "含": 1946,
      "听": 1947,
      "吭": 1948,
      "吮": 1949,
      "吳": 1950,
      "吶": 1951,
      "吸": 1952,
      "吹": 1953,
      "吻": 1954,
      "吼": 1955,
      "吽": 1956,
      "吾": 1957,
      "呀": 1958,
      "呂": 1959,
      "呃": 1960,
      "呆": 1961,
      "呈": 1962,
      "呉": 1963,
      "告": 1964,
      "呍": 1965,
      "呎": 1966,
      "呑": 1967,
      "呕": 1968,
      "呟": 1969,
      "呢": 1970,
      "呦": 1971,
      "周": 1972,
      "呪": 1973,
      "呰": 1974,
      "呱": 1975,
      "味": 1976,
      "呴": 1977,
      "呵": 1978,
      "呶": 1979,
      "呷": 1980,
      "呻": 1981,
      "呼": 1982,
      "命": 1983,
      "呿": 1984,
      "咀": 1985,
      "咄": 1986,
      "咆": 1987,
      "咈": 1988,
      "咋": 1989,
      "和": 1990,
      "咍": 1991,
      "咎": 1992,
      "咏": 1993,
      "咐": 1994,
      "咒": 1995,
      "咖": 1996,
      "咜": 1997,
      "咡": 1998,
      "咢": 1999,
      "咤": 2000,
      "咥": 2001,
      "咨": 2002,
      "咩": 2003,
      "咫": 2004,
      "咬": 2005,
      "咯": 2006,
      "咲": 2007,
      "咳": 2008,
      "咷": 2009,
      "咸": 2010,
      "咼": 2011,
      "咽": 2012,
      "咿": 2013,
      "哀": 2014,
      "品": 2015,
      "哂": 2016,
      "哃": 2017,
      "哄": 2018,
      "哆": 2019,
      "哇": 2020,
      "哈": 2021,
      "哉": 2022,
      "員": 2023,
      "哢": 2024,
      "哥": 2025,
      "哦": 2026,
      "哨": 2027,
      "哩": 2028,
      "哬": 2029,
      "哭": 2030,
      "哮": 2031,
      "哱": 2032,
      "哲": 2033,
      "哺": 2034,
      "哽": 2035,
      "唁": 2036,
      "唄": 2037,
      "唆": 2038,
      "唇": 2039,
      "唉": 2040,
      "唎": 2041,
      "唏": 2042,
      "唐": 2043,
      "唔": 2044,
      "唖": 2045,
      "唫": 2046,
      "售": 2047,
      "唯": 2048,
      "唱": 2049,
      "唳": 2050,
      "唵": 2051,
      "唸": 2052,
      "唹": 2053,
      "唼": 2054,
      "唾": 2055,
      "啀": 2056,
      "啄": 2057,
      "啅": 2058,
      "商": 2059,
      "啇": 2060,
      "啊": 2061,
      "啌": 2062,
      "問": 2063,
      "啐": 2064,
      "啓": 2065,
      "啖": 2066,
      "啗": 2067,
      "啜": 2068,
      "啡": 2069,
      "啣": 2070,
      "啤": 2071,
      "啦": 2072,
      "啻": 2073,
      "啼": 2074,
      "啾": 2075,
      "喀": 2076,
      "喁": 2077,
      "喃": 2078,
      "善": 2079,
      "喆": 2080,
      "喇": 2081,
      "喈": 2082,
      "喉": 2083,
      "喊": 2084,
      "喋": 2085,
      "喘": 2086,
      "喙": 2087,
      "喚": 2088,
      "喜": 2089,
      "喝": 2090,
      "喞": 2091,
      "喟": 2092,
      "喧": 2093,
      "喨": 2094,
      "喩": 2095,
      "喪": 2096,
      "喫": 2097,
      "喬": 2098,
      "喭": 2099,
      "單": 2100,
      "喰": 2101,
      "営": 2102,
      "喿": 2103,
      "嗄": 2104,
      "嗅": 2105,
      "嗇": 2106,
      "嗉": 2107,
      "嗎": 2108,
      "嗑": 2109,
      "嗒": 2110,
      "嗔": 2111,
      "嗚": 2112,
      "嗜": 2113,
      "嗝": 2114,
      "嗟": 2115,
      "嗢": 2116,
      "嗣": 2117,
      "嗤": 2118,
      "嗷": 2119,
      "嗹": 2120,
      "嗽": 2121,
      "嗾": 2122,
      "嘆": 2123,
      "嘈": 2124,
      "嘉": 2125,
      "嘎": 2126,
      "嘔": 2127,
      "嘖": 2128,
      "嘗": 2129,
      "嘘": 2130,
      "嘛": 2131,
      "嘩": 2132,
      "嘯": 2133,
      "嘱": 2134,
      "嘲": 2135,
      "嘴": 2136,
      "嘶": 2137,
      "嘷": 2138,
      "嘸": 2139,
      "嘻": 2140,
      "嘿": 2141,
      "噀": 2142,
      "噂": 2143,
      "噇": 2144,
      "噉": 2145,
      "噌": 2146,
      "噎": 2147,
      "噐": 2148,
      "噛": 2149,
      "噞": 2150,
      "噠": 2151,
      "噤": 2152,
      "噦": 2153,
      "器": 2154,
      "噪": 2155,
      "噫": 2156,
      "噬": 2157,
      "噯": 2158,
      "噱": 2159,
      "噲": 2160,
      "噴": 2161,
      "噶": 2162,
      "噸": 2163,
      "噺": 2164,
      "嚀": 2165,
      "嚆": 2166,
      "嚇": 2167,
      "嚊": 2168,
      "嚏": 2169,
      "嚔": 2170,
      "嚕": 2171,
      "嚙": 2172,
      "嚚": 2173,
      "嚝": 2174,
      "嚠": 2175,
      "嚢": 2176,
      "嚥": 2177,
      "嚨": 2178,
      "嚩": 2179,
      "嚬": 2180,
      "嚮": 2181,
      "嚲": 2182,
      "嚳": 2183,
      "嚴": 2184,
      "嚶": 2185,
      "嚼": 2186,
      "囀": 2187,
      "囁": 2188,
      "囂": 2189,
      "囃": 2190,
      "囅": 2191,
      "囈": 2192,
      "囉": 2193,
      "囎": 2194,
      "囑": 2195,
      "囓": 2196,
      "囗": 2197,
      "囘": 2198,
      "囚": 2199,
      "四": 2200,
      "回": 2201,
      "因": 2202,
      "团": 2203,
      "団": 2204,
      "园": 2205,
      "囮": 2206,
      "困": 2207,
      "囲": 2208,
      "図": 2209,
      "围": 2210,
      "囷": 2211,
      "囹": 2212,
      "固": 2213,
      "国": 2214,
      "囿": 2215,
      "圀": 2216,
      "圃": 2217,
      "圄": 2218,
      "圈": 2219,
      "圉": 2220,
      "圊": 2221,
      "國": 2222,
      "圍": 2223,
      "圏": 2224,
      "園": 2225,
      "圓": 2226,
      "圖": 2227,
      "團": 2228,
      "圜": 2229,
      "土": 2230,
      "圦": 2231,
      "圧": 2232,
      "在": 2233,
      "圩": 2234,
      "圭": 2235,
      "圯": 2236,
      "地": 2237,
      "圳": 2238,
      "圷": 2239,
      "圻": 2240,
      "址": 2241,
      "坂": 2242,
      "均": 2243,
      "坊": 2244,
      "坌": 2245,
      "坎": 2246,
      "坏": 2247,
      "坐": 2248,
      "坑": 2249,
      "坡": 2250,
      "坤": 2251,
      "坦": 2252,
      "坨": 2253,
      "坩": 2254,
      "坪": 2255,
      "坰": 2256,
      "坳": 2257,
      "坷": 2258,
      "坻": 2259,
      "坼": 2260,
      "垂": 2261,
      "型": 2262,
      "垓": 2263,
      "垜": 2264,
      "垠": 2265,
      "垢": 2266,
      "垣": 2267,
      "垤": 2268,
      "垨": 2269,
      "垪": 2270,
      "埀": 2271,
      "埃": 2272,
      "埈": 2273,
      "埋": 2274,
      "城": 2275,
      "埒": 2276,
      "埓": 2277,
      "埔": 2278,
      "埕": 2279,
      "埜": 2280,
      "域": 2281,
      "埠": 2282,
      "埣": 2283,
      "埤": 2284,
      "埭": 2285,
      "埴": 2286,
      "埵": 2287,
      "執": 2288,
      "埸": 2289,
      "培": 2290,
      "基": 2291,
      "埼": 2292,
      "埿": 2293,
      "堀": 2294,
      "堂": 2295,
      "堅": 2296,
      "堆": 2297,
      "堊": 2298,
      "堕": 2299,
      "堙": 2300,
      "堝": 2301,
      "堞": 2302,
      "堠": 2303,
      "堡": 2304,
      "堤": 2305,
      "堪": 2306,
      "堯": 2307,
      "堰": 2308,
      "報": 2309,
      "場": 2310,
      "堵": 2311,
      "堺": 2312,
      "塀": 2313,
      "塁": 2314,
      "塊": 2315,
      "塋": 2316,
      "塌": 2317,
      "塑": 2318,
      "塒": 2319,
      "塔": 2320,
      "塗": 2321,
      "塘": 2322,
      "塙": 2323,
      "塚": 2324,
      "塞": 2325,
      "塡": 2326,
      "塢": 2327,
      "塤": 2328,
      "塩": 2329,
      "填": 2330,
      "塲": 2331,
      "塵": 2332,
      "塹": 2333,
      "塼": 2334,
      "塾": 2335,
      "境": 2336,
      "墅": 2337,
      "墉": 2338,
      "墊": 2339,
      "墋": 2340,
      "墓": 2341,
      "増": 2342,
      "墜": 2343,
      "增": 2344,
      "墟": 2345,
      "墨": 2346,
      "墩": 2347,
      "墫": 2348,
      "墮": 2349,
      "墳": 2350,
      "墹": 2351,
      "墺": 2352,
      "墻": 2353,
      "墾": 2354,
      "壁": 2355,
      "壅": 2356,
      "壇": 2357,
      "壊": 2358,
      "壌": 2359,
      "壑": 2360,
      "壒": 2361,
      "壓": 2362,
      "壔": 2363,
      "壕": 2364,
      "壗": 2365,
      "壘": 2366,
      "壙": 2367,
      "壚": 2368,
      "壜": 2369,
      "壞": 2370,
      "壟": 2371,
      "壠": 2372,
      "壢": 2373,
      "壤": 2374,
      "壥": 2375,
      "壩": 2376,
      "士": 2377,
      "壬": 2378,
      "壮": 2379,
      "壯": 2380,
      "声": 2381,
      "壱": 2382,
      "売": 2383,
      "壳": 2384,
      "壷": 2385,
      "壹": 2386,
      "壺": 2387,
      "壻": 2388,
      "壼": 2389,
      "壽": 2390,
      "夂": 2391,
      "変": 2392,
      "夏": 2393,
      "夐": 2394,
      "夔": 2395,
      "夕": 2396,
      "外": 2397,
      "夙": 2398,
      "多": 2399,
      "夛": 2400,
      "夜": 2401,
      "夢": 2402,
      "夤": 2403,
      "夥": 2404,
      "大": 2405,
      "天": 2406,
      "太": 2407,
      "夫": 2408,
      "夬": 2409,
      "夭": 2410,
      "央": 2411,
      "失": 2412,
      "夷": 2413,
      "夸": 2414,
      "夾": 2415,
      "奄": 2416,
      "奇": 2417,
      "奈": 2418,
      "奉": 2419,
      "奎": 2420,
      "奏": 2421,
      "奐": 2422,
      "契": 2423,
      "奔": 2424,
      "奕": 2425,
      "套": 2426,
      "奘": 2427,
      "奚": 2428,
      "奝": 2429,
      "奠": 2430,
      "奢": 2431,
      "奥": 2432,
      "奧": 2433,
      "奨": 2434,
      "奩": 2435,
      "奪": 2436,
      "奬": 2437,
      "奭": 2438,
      "奮": 2439,
      "女": 2440,
      "奴": 2441,
      "奶": 2442,
      "奸": 2443,
      "好": 2444,
      "妁": 2445,
      "如": 2446,
      "妃": 2447,
      "妄": 2448,
      "妊": 2449,
      "妋": 2450,
      "妍": 2451,
      "妒": 2452,
      "妓": 2453,
      "妖": 2454,
      "妙": 2455,
      "妝": 2456,
      "妣": 2457,
      "妤": 2458,
      "妥": 2459,
      "妨": 2460,
      "妬": 2461,
      "妲": 2462,
      "妹": 2463,
      "妻": 2464,
      "妼": 2465,
      "妾": 2466,
      "姆": 2467,
      "姈": 2468,
      "姉": 2469,
      "始": 2470,
      "姐": 2471,
      "姑": 2472,
      "姒": 2473,
      "姓": 2474,
      "委": 2475,
      "姙": 2476,
      "姚": 2477,
      "姜": 2478,
      "姝": 2479,
      "姞": 2480,
      "姣": 2481,
      "姥": 2482,
      "姦": 2483,
      "姧": 2484,
      "姨": 2485,
      "姪": 2486,
      "姫": 2487,
      "姶": 2488,
      "姻": 2489,
      "姿": 2490,
      "威": 2491,
      "娃": 2492,
      "娉": 2493,
      "娌": 2494,
      "娑": 2495,
      "娓": 2496,
      "娘": 2497,
      "娚": 2498,
      "娜": 2499,
      "娟": 2500,
      "娠": 2501,
      "娥": 2502,
      "娧": 2503,
      "娩": 2504,
      "娯": 2505,
      "娵": 2506,
      "娶": 2507,
      "娼": 2508,
      "婀": 2509,
      "婁": 2510,
      "婆": 2511,
      "婉": 2512,
      "婕": 2513,
      "婚": 2514,
      "婢": 2515,
      "婦": 2516,
      "婪": 2517,
      "婬": 2518,
      "婭": 2519,
      "婷": 2520,
      "婺": 2521,
      "婾": 2522,
      "婿": 2523,
      "媒": 2524,
      "媚": 2525,
      "媛": 2526,
      "媟": 2527,
      "媢": 2528,
      "媧": 2529,
      "媯": 2530,
      "媱": 2531,
      "媳": 2532,
      "媵": 2533,
      "媼": 2534,
      "媽": 2535,
      "媾": 2536,
      "媿": 2537,
      "嫁": 2538,
      "嫂": 2539,
      "嫄": 2540,
      "嫉": 2541,
      "嫋": 2542,
      "嫌": 2543,
      "嫐": 2544,
      "嫖": 2545,
      "嫗": 2546,
      "嫜": 2547,
      "嫠": 2548,
      "嫡": 2549,
      "嫣": 2550,
      "嫦": 2551,
      "嫩": 2552,
      "嫮": 2553,
      "嫰": 2554,
      "嫵": 2555,
      "嫺": 2556,
      "嫻": 2557,
      "嬀": 2558,
      "嬈": 2559,
      "嬉": 2560,
      "嬋": 2561,
      "嬌": 2562,
      "嬖": 2563,
      "嬙": 2564,
      "嬛": 2565,
      "嬢": 2566,
      "嬥": 2567,
      "嬪": 2568,
      "嬬": 2569,
      "嬭": 2570,
      "嬰": 2571,
      "嬲": 2572,
      "嬴": 2573,
      "嬶": 2574,
      "嬾": 2575,
      "孀": 2576,
      "孁": 2577,
      "孃": 2578,
      "孅": 2579,
      "孌": 2580,
      "子": 2581,
      "孑": 2582,
      "孒": 2583,
      "孔": 2584,
      "孕": 2585,
      "孖": 2586,
      "字": 2587,
      "存": 2588,
      "孚": 2589,
      "孛": 2590,
      "孜": 2591,
      "孝": 2592,
      "孟": 2593,
      "季": 2594,
      "孤": 2595,
      "孥": 2596,
      "学": 2597,
      "孩": 2598,
      "孫": 2599,
      "孰": 2600,
      "孱": 2601,
      "孳": 2602,
      "孵": 2603,
      "學": 2604,
      "孺": 2605,
      "孼": 2606,
      "孽": 2607,
      "孿": 2608,
      "宀": 2609,
      "它": 2610,
      "宄": 2611,
      "宅": 2612,
      "宇": 2613,
      "守": 2614,
      "安": 2615,
      "宋": 2616,
      "完": 2617,
      "宍": 2618,
      "宏": 2619,
      "宓": 2620,
      "宕": 2621,
      "宗": 2622,
      "官": 2623,
      "宙": 2624,
      "定": 2625,
      "宛": 2626,
      "宜": 2627,
      "宝": 2628,
      "実": 2629,
      "客": 2630,
      "宣": 2631,
      "室": 2632,
      "宥": 2633,
      "宦": 2634,
      "宬": 2635,
      "宮": 2636,
      "宰": 2637,
      "害": 2638,
      "宴": 2639,
      "宵": 2640,
      "家": 2641,
      "宸": 2642,
      "容": 2643,
      "宿": 2644,
      "寀": 2645,
      "寂": 2646,
      "寃": 2647,
      "寄": 2648,
      "寅": 2649,
      "密": 2650,
      "寇": 2651,
      "寉": 2652,
      "富": 2653,
      "寐": 2654,
      "寒": 2655,
      "寓": 2656,
      "寔": 2657,
      "寖": 2658,
      "寘": 2659,
      "寛": 2660,
      "寝": 2661,
      "寞": 2662,
      "察": 2663,
      "寡": 2664,
      "寢": 2665,
      "寤": 2666,
      "寥": 2667,
      "實": 2668,
      "寧": 2669,
      "寨": 2670,
      "審": 2671,
      "寫": 2672,
      "寬": 2673,
      "寮": 2674,
      "寰": 2675,
      "寱": 2676,
      "寳": 2677,
      "寵": 2678,
      "寶": 2679,
      "寸": 2680,
      "对": 2681,
      "寺": 2682,
      "対": 2683,
      "寿": 2684,
      "封": 2685,
      "専": 2686,
      "射": 2687,
      "尅": 2688,
      "将": 2689,
      "將": 2690,
      "專": 2691,
      "尉": 2692,
      "尊": 2693,
      "尋": 2694,
      "對": 2695,
      "導": 2696,
      "小": 2697,
      "少": 2698,
      "尓": 2699,
      "尖": 2700,
      "尚": 2701,
      "尠": 2702,
      "尢": 2703,
      "尤": 2704,
      "尨": 2705,
      "尩": 2706,
      "尫": 2707,
      "尭": 2708,
      "就": 2709,
      "尸": 2710,
      "尹": 2711,
      "尺": 2712,
      "尻": 2713,
      "尼": 2714,
      "尽": 2715,
      "尾": 2716,
      "尿": 2717,
      "局": 2718,
      "屁": 2719,
      "居": 2720,
      "屆": 2721,
      "屈": 2722,
      "届": 2723,
      "屋": 2724,
      "屍": 2725,
      "屎": 2726,
      "屏": 2727,
      "屐": 2728,
      "屑": 2729,
      "屓": 2730,
      "展": 2731,
      "属": 2732,
      "屠": 2733,
      "屡": 2734,
      "屢": 2735,
      "屣": 2736,
      "層": 2737,
      "履": 2738,
      "屨": 2739,
      "屩": 2740,
      "屬": 2741,
      "屯": 2742,
      "山": 2743,
      "屹": 2744,
      "屼": 2745,
      "岌": 2746,
      "岏": 2747,
      "岐": 2748,
      "岑": 2749,
      "岔": 2750,
      "岠": 2751,
      "岡": 2752,
      "岣": 2753,
      "岦": 2754,
      "岧": 2755,
      "岨": 2756,
      "岩": 2757,
      "岫": 2758,
      "岬": 2759,
      "岱": 2760,
      "岳": 2761,
      "岷": 2762,
      "岸": 2763,
      "峅": 2764,
      "峋": 2765,
      "峙": 2766,
      "峠": 2767,
      "峡": 2768,
      "峨": 2769,
      "峩": 2770,
      "峪": 2771,
      "峭": 2772,
      "峯": 2773,
      "峰": 2774,
      "峴": 2775,
      "島": 2776,
      "峻": 2777,
      "峽": 2778,
      "崇": 2779,
      "崋": 2780,
      "崎": 2781,
      "崐": 2782,
      "崑": 2783,
      "崔": 2784,
      "崕": 2785,
      "崖": 2786,
      "崗": 2787,
      "崙": 2788,
      "崚": 2789,
      "崛": 2790,
      "崢": 2791,
      "崧": 2792,
      "崩": 2793,
      "崫": 2794,
      "嵂": 2795,
      "嵆": 2796,
      "嵇": 2797,
      "嵊": 2798,
      "嵌": 2799,
      "嵎": 2800,
      "嵐": 2801,
      "嵒": 2802,
      "嵓": 2803,
      "嵜": 2804,
      "嵩": 2805,
      "嵬": 2806,
      "嵯": 2807,
      "嵶": 2808,
      "嶁": 2809,
      "嶂": 2810,
      "嶄": 2811,
      "嶇": 2812,
      "嶋": 2813,
      "嶌": 2814,
      "嶐": 2815,
      "嶒": 2816,
      "嶙": 2817,
      "嶝": 2818,
      "嶠": 2819,
      "嶢": 2820,
      "嶧": 2821,
      "嶮": 2822,
      "嶰": 2823,
      "嶷": 2824,
      "嶸": 2825,
      "嶹": 2826,
