[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
<unused0>
<unused1>
<unused2>
<unused3>
<unused4>
<unused5>
<unused6>
<unused7>
<unused8>
<unused9>
!
"
#
$
%
&
'
(
)
*
+
,
-
.
/
0
1
2
3
4
5
6
7
8
9
:
;
<
=
>
?
@
A
B
C
D
E
F
G
H
I
J
K
L
M
N
O
P
Q
R
S
T
U
V
W
X
Y
Z
[
\
]
^
_
`
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
{
|
}
~
¡
¢
£
¥
§
¨
©
«
¬
®
°
±
´
¶
·
»
¼
½
¾
¿
À
Á
Â
Ä
Å
Æ
Ç
È
É
Ê
Í
Î
Ó
Ô
Ö
×
Ø
Ú
Û
Ü
Þ
ß
à
á
â
ã
ä
å
æ
ç
è
é
ê
ë
ì
í
î
ï
ð
ñ
ò
ó
ô
õ
ö
÷
ø
ù
ú
û
ü
ý
þ
ÿ
Ā
ā
ă
ą
Ć
ć
Č
č
Đ
đ
ē
ĕ
ė
ę
ě
ĝ
ğ
ħ
ĩ
Ī
ī
İ
ı
Ł
ł
ń
ň
ŋ
Ō
ō
ŏ
ő
Œ
œ
ř
Ś
ś
Ş
ş
Š
š
ţ
ť
ũ
ū
ŭ
ů
ź
Ż
ż
Ž
ž
ơ
ư
ǁ
ǎ
ǐ
ǒ
ǔ
ǰ
ș
ȝ
ɐ
ɑ
ɒ
ɔ
ɕ
ə
ɛ
ɟ
ɡ
ɣ
ɦ
ɨ
ɪ
ɫ
ɯ
ɲ
ɴ
ɸ
ɹ
ɾ
ʁ
ʃ
ʊ
ʌ
ʎ
ʏ
ʑ
ʒ
ʔ
ʕ
ʧ
ʻ
ʼ
ʿ
ˀ
ˈ
ˌ
ː
́
̃
̈
̓
̝
̥
̩
̯
͡
Ά
Α
Β
Γ
Δ
Ε
Ζ
Η
Θ
Ι
Κ
Λ
Μ
Ν
Ξ
Ο
Π
Ρ
Σ
Τ
Υ
Φ
Χ
Ψ
Ω
ά
έ
ή
ί
α
β
γ
δ
ε
ζ
η
θ
ι
κ
λ
μ
ν
ξ
ο
π
ρ
ς
σ
τ
υ
φ
χ
ψ
ω
ό
ύ
ώ
Ё
І
Ј
А
Б
В
Г
Д
Е
Ж
З
И
Й
К
Л
М
Н
О
П
Р
С
Т
У
Ф
Х
Ц
Ч
Ш
Ы
Ь
Э
Ю
Я
а
б
в
г
д
е
ж
з
и
й
к
л
м
н
о
п
р
с
т
у
ф
х
ц
ч
ш
щ
ъ
ы
ь
э
ю
я
ё
і
ї
ј
њ
ћ
қ
ү
ө
Ա
ա
գ
ե
ի
յ
ն
ո
տ
ր
ւ
ְ
ִ
ֵ
ֶ
ַ
ָ
ֹ
ּ
ׁ
א
ב
ג
ד
ה
ו
ז
ח
ט
י
כ
ל
ם
מ
ן
נ
ס
ע
פ
צ
ק
ר
ש
ת
،
ء
آ
أ
إ
ئ
ا
ب
ة
ت
ث
ج
ح
خ
د
ر
ز
س
ش
ص
ض
ط
ظ
ع
غ
ـ
ف
ق
ك
ل
م
ن
ه
و
ى
ي
َ
ِ
ْ
پ
چ
ک
گ
ھ
ہ
ی
ە
ं
अ
क
ख
ग
च
ज
ट
ड
ण
त
द
ध
न
प
ब
भ
म
य
र
ल
व
श
स
ह
़
ा
ि
ी
ु
ू
े
ो
्
ম
র
া
ু
্
அ
க
ச
ட
த
ன
ப
ம
ய
ர
ற
ல
ழ
வ
ா
ி
ு
ை
்
ర
ರ
ು
ി
്
ක
ත
ද
න
ප
ම
ය
ර
ව
ස
්
ා
ි
ු
ก
ข
ค
ง
จ
ช
ญ
ณ
ด
ต
ถ
ท
ธ
น
บ
ป
ผ
พ
ฟ
ภ
ม
ย
ร
ล
ว
ศ
ส
ห
อ
ะ
ั
า
ิ
ี
ื
ุ
ู
เ
แ
โ
ไ
็
่
้
์
ํ
ດ
ນ
ປ
ວ
ສ
ະ
າ
ເ
་
ག
ང
ད
ན
བ
མ
ར
ལ
ས
ི
ོ
ླ
က
င
တ
န
ပ
ရ
ာ
ိ
ု
ေ
း
်
ြ
ა
ბ
გ
დ
ე
ვ
თ
ი
ლ
მ
ნ
ო
რ
ს
ტ
უ
ქ
ყ
წ
ᄇ
ᅵ
አ
ក
ង
ត
ន
ព
រ
ា
្
ᠠ
ᠡ
ᠢ
ᠣ
ᠤ
ᠨ
ᠩ
ᠪ
ᠭ
ᠮ
ᠯ
ᠷ
ᡝ
ᡞ
ᡠ
ᡥ
ḍ
Ḥ
ḥ
ḫ
ṃ
ṅ
ṇ
ṛ
ṣ
ṭ
ạ
ả
ấ
ầ
ế
ề
ệ
ị
ố
ồ
ộ
ờ
ụ
ἀ
Ἀ
ἐ
Ἑ
ἰ
ὁ
ὰ
ά
ὲ
έ
ὶ
ῖ
‐
–
—
―
‖
‘
’
“
”
„
†
‡
•
‥
…
‧
‰
′
″
※
‼
⁂
⁄
⁇
⁈
⁉
℃
ℓ
Å
ℵ
⅓
⅔
Ⅰ
Ⅱ
Ⅲ
Ⅳ
Ⅴ
Ⅵ
Ⅶ
Ⅷ
Ⅸ
Ⅹ
Ⅺ
Ⅻ
ⅰ
ⅱ
ⅳ
ⅴ
ⅵ
ⅸ
ⅹ
ⅺ
←
↑
→
↓
↘
↦
⇒
⇔
∀
∂
∃
∈
∑
−
∖
∗
√
∞
∠
∥
∧
∨
∩
∪
∴
∽
≈
≒
≠
≡
≤
≥
≦
≧
≪
≫
⊂
⊆
⊗
⊿
⋅
⋯
⌒
①
②
③
④
⑤
⑥
⑦
⑧
⑨
⑩
⑪
⑫
⑬
⑭
⑮
⑯
⑰
⑱
⑲
⑳
ⓐ
ⓑ
ⓒ
ⓓ
─
━
│
┃
┌
┏
┐
┓
└
┗
┘
┛
├
┠
┣
┤
┨
┬
┯
┳
┴
┷
┼
█
■
□
▲
△
▶
▼
▽
◆
◇
◉
○
◎
●
◦
◯
★
☆
☉
☞
♀
♂
♠
♡
♣
♥
♦
♩
♪
♭
♯
✓
✩
❷
❸
❹
⟨
⟩
⦿
ⴰ
　
、
。
〃
々
〆
〇
〈
〉
《
》
「
」
『
』
【
】
〒
〓
〔
〕
〜
〝
〟
〰
〻
〼
〽
ぁ
あ
ぃ
い
ぅ
う
ぇ
え
ぉ
お
か
が
き
ぎ
く
ぐ
け
げ
こ
ご
さ
ざ
し
じ
す
ず
せ
ぜ
そ
ぞ
た
だ
ち
ぢ
っ
つ
づ
て
で
と
ど
な
に
ぬ
ね
の
は
ば
ぱ
ひ
び
ぴ
ふ
ぶ
ぷ
へ
べ
ぺ
ほ
ぼ
ぽ
ま
み
む
め
も
ゃ
や
ゅ
ゆ
ょ
よ
ら
り
る
れ
ろ
ゎ
わ
ゐ
ゑ
を
ん
ゔ
゙
゚
゛
゜
ゝ
ゞ
ゟ
゠
ァ
ア
ィ
イ
ゥ
ウ
ェ
エ
ォ
オ
カ
ガ
キ
ギ
ク
グ
ケ
ゲ
コ
ゴ
サ
ザ
シ
ジ
ス
ズ
セ
ゼ
ソ
ゾ
タ
ダ
チ
ヂ
ッ
ツ
ヅ
テ
デ
ト
ド
ナ
ニ
ヌ
ネ
ノ
ハ
バ
パ
ヒ
ビ
ピ
フ
ブ
プ
ヘ
ベ
ペ
ホ
ボ
ポ
マ
ミ
ム
メ
モ
ャ
ヤ
ュ
ユ
ョ
ヨ
ラ
リ
ル
レ
ロ
ヮ
ワ
ヰ
ヱ
ヲ
ン
ヴ
ヵ
ヶ
ヷ
ヸ
ヹ
ヺ
・
ー
ヽ
ヾ
ヿ
㆑
ㇰ
ㇱ
ㇲ
ㇳ
ㇴ
ㇵ
ㇶ
ㇷ
ㇸ
ㇹ
ㇺ
ㇻ
ㇼ
ㇽ
ㇿ
㉑
㉒
㋚
㋜
㋡
㏄
㒵
㔟
㕝
㕞
㕮
㗅
㘅
㝫
㝵
㟽
㡡
㩮
㩳
㮈
㮶
㰏
㷀
㷔
㸅
㹠
䇳
䏰
䑛
䒾
䔥
䕃
䖝
䘏
䟽
䠖
䢵
䬻
䰗
一
丁
七
万
丈
三
上
下
不
与
丏
丐
丑
且
丕
世
丗
丘
丙
东
丞
両
並
丨
个
丫
中
丯
丰
丱
串
丶
丸
丹
主
丼
丿
乀
乂
乃
久
么
之
乍
乎
乏
乐
乕
乖
乗
乘
乙
九
乞
也
乢
乭
乱
乳
乾
亀
亂
亅
了
予
争
事
二
亍
于
云
互
五
井
亘
亙
些
亜
亞
亟
亠
亡
亢
交
亥
亦
亨
享
京
亭
亮
亳
亶
亹
人
亻
什
仁
仂
仄
仆
仇
今
介
仍
从
仏
仔
仕
他
仗
付
仙
仝
仞
仟
仡
代
令
以
仭
仮
仰
仲
件
价
任
份
仿
企
伃
伉
伊
伍
伎
伏
伐
休
会
伜
伝
伯
估
伴
伶
伷
伸
伺
似
伽
佃
但
佇
佈
佉
位
低
住
佐
佑
体
佔
何
佗
余
佚
佛
作
佝
佞
佟
你
佩
佪
佬
佯
佰
佳
併
佶
佺
佻
佼
佽
佾
使
侂
侃
來
侈
例
侍
侏
侑
侔
侖
侗
侘
供
依
侠
価
侫
侭
侮
侯
侵
侶
便
俀
係
促
俄
俅
俊
俎
俏
俐
俑
俗
俘
俚
俛
保
俟
俠
信
俣
俤
俥
修
俯
俱
俳
俵
俶
俸
俺
俾
倀
倅
倆
倉
個
倍
倏
倐
們
倒
倔
倖
倘
候
倚
倜
倞
借
倡
倣
値
倥
倦
倧
倨
倩
倪
倫
倬
倭
倮
倶
倹
倻
偁
偃
假
偈
偉
偎
偏
偐
偓
偕
偖
做
停
健
偪
偬
偲
側
偵
偶
偸
偽
傀
傅
傍
傑
傒
傔
傕
傖
傘
備
傚
傪
催
傭
傱
傲
傳
傴
債
傷
傾
僂
僄
僅
僇
僉
僊
働
僎
像
僑
僕
僖
僚
僞
僣
僥
僦
僧
僩
僭
僮
僴
僵
價
僻
儀
儁
儂
儃
億
儆
儈
儉
儋
儒
儔
儕
儗
儘
儚
儛
儞
償
儡
優
儲
儵
儷
儺
儻
儼
儿
兀
允
元
兄
充
兆
兇
先
光
克
兌
免
兎
児
兒
兔
兕
兗
党
兜
兢
入
內
全
兩
兪
八
公
六
兮
共
兴
兵
其
具
典
兼
冀
冂
内
円
冉
冊
册
再
冏
冐
冑
冒
冕
冖
冗
写
军
冠
冢
冤
冥
冦
冨
冩
冪
冫
冬
冰
冱
冲
决
冴
况
冶
冷
冼
冽
凄
凅
准
凉
凋
凌
凍
凖
凛
凜
凝
凞
几
凡
処
凧
凩
凪
凭
凮
凰
凱
凳
凴
凵
凶
凸
凹
出
函
凾
刀
刁
刃
刄
分
切
刈
刊
刋
刎
刑
刓
刔
刕
刖
列
初
判
別
刧
利
刪
刮
到
刳
制
刷
券
刹
刺
刻
剃
剄
則
剉
削
剋
剌
前
剏
剔
剕
剖
剗
剛
剜
剝
剞
剡
剣
剤
剥
剩
剪
副
剰
剱
割
剳
剴
創
剽
剿
劂
劃
劄
劇
劈
劉
劍
劑
劒
劓
劔
力
功
加
劣
动
助
努
劫
劬
劭
励
労
劵
効
劾
勁
勃
勅
勇
勉
勑
勒
動
勖
勗
勘
務
勛
勝
勞
募
勢
勣
勤
勦
勧
勰
勲
勳
勵
勸
勹
勺
勾
勿
匀
匁
匂
包
匆
匇
匈
匍
匏
匐
匕
化
北
匙
匚
匜
匝
匠
匡
匣
匪
匯
匱
匳
匵
匹
区
医
匾
匿
區
十
千
卅
升
午
卉
半
卍
华
卑
卒
卓
協
南
単
博
卜
卞
占
卡
卦
卩
卬
卯
印
危
即
却
卵
卷
卸
卺
卻
卽
卿
厂
厄
厓
厖
厘
厙
厚
厝
原
厠
厥
厦
厨
厩
厭
厮
厰
厲
厳
厴
厶
去
参
參
又
叉
及
友
双
反
収
叔
叕
取
受
叙
叚
叛
叟
叡
叢
口
古
句
叨
叩
只
叫
召
叭
叮
可
台
叱
史
右
叵
叶
号
司
叺
吁
吃
各
合
吉
吊
吋
同
名
后
吏
吐
向
吒
君
吝
吞
吟
吠
否
吧
吨
吩
含
听
吭
吮
吳
吶
吸
吹
吻
吼
吽
吾
呀
呂
呃
呆
呈
呉
告
呍
呎
呑
呕
呟
呢
呦
周
呪
呰
呱
味
呴
呵
呶
呷
呻
呼
命
呿
咀
咄
咆
咈
咋
和
咍
咎
咏
咐
咒
咖
咜
咡
咢
咤
咥
咨
咩
咫
咬
咯
咲
咳
咷
咸
咼
咽
咿
哀
品
哂
哃
哄
哆
哇
哈
哉
員
哢
哥
哦
哨
哩
哬
哭
哮
哱
哲
哺
哽
唁
唄
唆
唇
唉
唎
唏
唐
唔
唖
唫
售
唯
唱
唳
唵
唸
唹
唼
唾
啀
啄
啅
商
啇
啊
啌
問
啐
啓
啖
啗
啜
啡
啣
啤
啦
啻
啼
啾
喀
喁
喃
善
喆
喇
喈
喉
喊
喋
喘
喙
喚
喜
喝
喞
喟
喧
喨
喩
喪
喫
喬
喭
單
喰
営
喿
嗄
嗅
嗇
嗉
嗎
嗑
嗒
嗔
嗚
嗜
嗝
嗟
嗢
嗣
嗤
嗷
嗹
嗽
嗾
嘆
嘈
嘉
嘎
嘔
嘖
嘗
嘘
嘛
嘩
嘯
嘱
嘲
嘴
嘶
嘷
嘸
嘻
嘿
噀
噂
噇
噉
噌
噎
噐
噛
噞
噠
噤
噦
器
噪
噫
噬
噯
噱
噲
噴
噶
噸
噺
嚀
嚆
嚇
嚊
嚏
嚔
嚕
嚙
嚚
嚝
嚠
嚢
嚥
嚨
嚩
嚬
嚮
嚲
嚳
嚴
嚶
嚼
囀
囁
囂
囃
囅
囈
囉
囎
囑
囓
囗
囘
囚
四
回
因
团
団
园
囮
困
囲
図
围
囷
囹
固
国
囿
圀
圃
圄
圈
圉
圊
國
圍
圏
園
圓
圖
團
圜
土
圦
圧
在
圩
圭
圯
地
圳
圷
圻
址
坂
均
坊
坌
坎
坏
坐
坑
坡
坤
坦
坨
坩
坪
坰
坳
坷
坻
坼
垂
型
垓
垜
垠
垢
垣
垤
垨
垪
埀
埃
埈
埋
城
埒
埓
埔
埕
埜
域
埠
埣
埤
埭
埴
埵
執
埸
培
基
埼
埿
堀
堂
堅
堆
堊
堕
堙
堝
堞
堠
堡
堤
堪
堯
堰
報
場
堵
堺
塀
塁
塊
塋
塌
塑
塒
塔
塗
塘
塙
塚
塞
塡
塢
塤
塩
填
塲
塵
塹
塼
塾
境
墅
墉
墊
墋
墓
増
墜
增
墟
墨
墩
墫
墮
墳
墹
墺
墻
墾
壁
壅
壇
壊
壌
壑
壒
壓
壔
壕
壗
壘
壙
壚
壜
壞
壟
壠
壢
壤
壥
壩
士
壬
壮
壯
声
壱
売
壳
壷
壹
壺
壻
壼
壽
夂
変
夏
夐
夔
夕
外
夙
多
夛
夜
夢
夤
夥
大
天
太
夫
夬
夭
央
失
夷
夸
夾
奄
奇
奈
奉
奎
奏
奐
契
奔
奕
套
奘
奚
奝
奠
奢
奥
奧
奨
奩
奪
奬
奭
奮
女
奴
奶
奸
好
妁
如
妃
妄
妊
妋
妍
妒
妓
妖
妙
妝
妣
妤
妥
妨
妬
妲
妹
妻
妼
妾
姆
姈
姉
始
姐
姑
姒
姓
委
姙
姚
姜
姝
姞
姣
姥
姦
姧
姨
姪
姫
姶
姻
姿
威
娃
娉
娌
娑
娓
娘
娚
娜
娟
娠
娥
娧
娩
娯
娵
娶
娼
婀
婁
婆
婉
婕
婚
婢
婦
婪
婬
婭
婷
婺
婾
婿
媒
媚
媛
媟
媢
媧
媯
媱
媳
媵
媼
媽
媾
媿
嫁
嫂
嫄
嫉
嫋
嫌
嫐
嫖
嫗
嫜
嫠
嫡
嫣
嫦
嫩
嫮
嫰
嫵
嫺
嫻
嬀
嬈
嬉
嬋
嬌
嬖
嬙
嬛
嬢
嬥
嬪
嬬
嬭
嬰
嬲
嬴
嬶
嬾
孀
孁
孃
孅
孌
子
孑
孒
孔
孕
孖
字
存
孚
孛
孜
孝
孟
季
孤
孥
学
孩
孫
孰
孱
孳
孵
學
孺
孼
孽
孿
宀
它
宄
宅
宇
守
安
宋
完
宍
宏
宓
宕
宗
官
宙
定
宛
宜
宝
実
客
宣
室
宥
宦
宬
宮
宰
害
宴
宵
家
宸
容
宿
寀
寂
寃
寄
寅
密
寇
寉
富
寐
寒
寓
寔
寖
寘
寛
寝
寞
察
寡
寢
寤
寥
實
寧
寨
審
寫
寬
寮
寰
寱
寳
寵
寶
寸
对
寺
対
寿
封
専
射
尅
将
將
專
尉
尊
尋
對
導
小
少
尓
尖
尚
尠
尢
尤
尨
尩
尫
尭
就
尸
尹
尺
尻
尼
尽
尾
尿
局
屁
居
屆
屈
届
屋
屍
屎
屏
屐
屑
屓
展
属
屠
屡
屢
屣
層
履
屨
屩
屬
屯
山
屹
屼
岌
岏
岐
岑
岔
岠
岡
岣
岦
岧
岨
岩
岫
岬
岱
岳
岷
岸
峅
峋
峙
峠
峡
峨
峩
峪
峭
峯
峰
峴
島
峻
峽
崇
崋
崎
崐
崑
崔
崕
崖
崗
崙
崚
崛
崢
崧
崩
崫
嵂
嵆
嵇
嵊
嵌
嵎
嵐
嵒
嵓
嵜
嵩
嵬
嵯
嵶
嶁
嶂
嶄
嶇
嶋
嶌
嶐
嶒
嶙
嶝
嶠
嶢
嶧
嶮
嶰
嶷
嶸
嶹
嶺
嶼
嶽
巉
巋
巌
巍
巑
巒
巓
巖
巘
川
州
巠
巡
巢
巣
巤
工
左
巧
巨
巫
差
己
已
巳
巴
巵
巷
巻
巽
巾
帀
市
布
帆
帋
希
帑
帒
帔
帕
帖
帘
帙
帚
帛
帝
帟
帥
師
席
帮
帯
帰
帳
帶
帷
常
帽
幀
幃
幄
幅
幇
幌
幔
幕
幗
幘
幞
幟
幡
幢
幣
幤
幫
幮
干
平
年
幵
并
幸
幹
幺
幻
幼
幽
幾
广
庁
広
庄
庇
床
序
底
庖
店
庚
府
庠
度
座
庪
庫
庭
庵
庶
康
庸
庾
庿
廁
廂
廃
廆
廈
廉
廊
廋
廏
廐
廓
廖
廙
廚
廛
廝
廞
廟
廠
廡
廢
廣
廨
廩
廬
廰
廳
延
廷
廸
建
廻
廼
廾
廿
开
弁
异
弃
弄
弇
弈
弉
弊
弋
弌
弍
式
弐
弑
弓
弔
引
弖
弗
弘
弛
弟
张
弣
弥
弦
弧
弩
弭
弯
弱
弴
張
弶
強
弼
弽
弾
彀
彅
彈
彊
彌
彎
当
彔
彖
彗
彘
彙
彜
彝
彡
形
彤
彦
彧
彩
彪
彫
彬
彭
彰
影
彳
彷
役
彼
彽
彿
往
征
徂
徃
径
待
徇
很
徉
徊
律
後
徐
徑
徒
従
得
徘
徙
徜
從
徠
御
徧
徨
復
循
徭
微
徳
徴
徵
德
徸
徹
徼
徽
心
必
忉
忌
忍
忓
忖
志
忘
忙
応
忝
忞
忠
忡
忤
忩
快
忮
忰
忱
念
忸
忻
忽
忿
怍
怎
怏
怒
怔
怕
怖
怗
怙
怛
怜
思
怠
怡
急
性
怨
怩
怪
怫
怯
怱
怳
怵
怺
恁
恂
恃
恆
恊
恋
恍
恐
恒
恕
恙
恚
恟
恠
恢
恣
恤
恥
恨
恩
恪
恫
恬
恭
息
恰
恵
悁
悃
悄
悉
悋
悌
悍
悒
悔
悕
悖
悚
悛
悝
悞
悟
悠
患
悦
悧
悩
悪
悰
悱
悲
悳
悴
悵
悶
悸
悼
悽
悾
情
惆
惇
惋
惑
惓
惔
惕
惘
惚
惛
惜
惝
惟
惠
惡
惣
惧
惨
惮
惰
惱
惲
想
惴
惶
惸
惹
惺
惻
愀
愁
愆
愈
愉
愍
愎
意
愒
愓
愔
愕
愚
愛
愜
感
愡
愧
愨
愬
愴
愷
愺
愼
愽
愾
愿
慂
慄
慇
慈
慊
態
慌
慍
慎
慓
慕
慘
慙
慚
慝
慟
慠
慢
慣
慥
慧
慨
慫
慮
慰
慳
慴
慵
慶
慷
慼
慾
憂
憇
憊
憍
憎
憐
憑
憒
憔
憖
憗
憘
憙
憚
憤
憥
憧
憩
憫
憬
憮
憲
憶
憹
憺
憾
懃
懆
懇
懈
應
懊
懋
懌
懍
懐
懕
懟
懣
懦
懲
懴
懵
懶
懷
懸
懺
懼
懽
懾
懿
戀
戈
戊
戌
戍
戎
成
我
戒
戔
戕
或
战
戚
戛
戞
戟
戡
戢
戦
戩
截
戮
戯
戰
戲
戴
戸
戻
房
所
扁
扃
扆
扇
扈
扉
手
才
扎
打
払
托
扛
扞
扠
扣
扨
扭
扮
扯
扱
扶
批
扼
承
技
抂
抃
抄
抅
抉
把
抑
抒
抓
抔
投
抖
抗
折
抛
抜
択
抦
披
抬
抱
抵
抹
押
抽
拂
拄
担
拆
拇
拈
拉
拊
拌
拍
拏
拐
拑
拒
拓
拔
拖
拗
拘
拙
招
拜
拝
拠
拡
括
拭
拮
拯
拱
拳
拵
拶
拷
拼
拽
拾
拿
持
挂
指
挈
按
挊
挌
挍
挐
挑
挖
挘
挙
挟
挨
挫
振
挲
挹
挺
挽
挾
挿
捃
捄
捉
捌
捍
捏
捐
捕
捗
捜
捥
捧
捨
捩
捫
捬
据
捲
捶
捷
捺
捻
掀
掃
授
掉
掌
掎
掏
排
掖
掘
掙
掛
掟
掠
採
探
掣
接
控
推
掩
措
掬
掲
掴
掻
掾
揀
揃
揄
揆
揉
描
提
插
揖
揚
換
揠
握
揣
揩
揭
揮
援
揵
揶
揷
揺
搆
搉
損
搏
搐
搓
搖
搗
搜
搢
搥
搦
搨
搬
搭
搯
搴
搶
携
搾
摂
摎
摑
摔
摘
摚
摛
摠
摧
摩
摭
摯
摳
摶
摸
摹
摺
摽
撃
撇
撈
撑
撒
撓
撕
撚
撞
撤
撥
撩
撫
播
撮
撰
撲
撹
撻
撼
撾
撿
擁
擂
擄
擅
擇
擊
擋
操
擎
擐
擒
擔
擕
擘
據
擠
擡
擢
擣
擤
擥
擦
擧
擬
擯
擱
擲
擴
擷
擺
擻
擽
擾
擿
攀
攄
攅
攔
攖
攘
攜
攝
攢
攣
攤
攩
攪
攫
攬
支
攲
攴
攵
收
攷
攸
改
攻
放
政
故
效
敍
敎
敏
救
敕
敖
敗
教
敝
敞
敢
散
敦
敧
敬
数
敲
整
敵
敷
數
斂
斃
斅
文
斉
斌
斎
斐
斑
斗
料
斛
斜
斟
斡
斤
斥
斧
斫
斬
断
斯
新
斲
斷
方
於
施
旁
旂
旃
旄
旅
旆
旋
旌
族
旒
旗
旙
旛
无
旡
既
日
旦
旧
旨
早
旬
旭
旱
旲
旺
旻
昀
昂
昃
昆
昇
昉
昊
昌
明
昏
易
昔
昕
昜
昞
星
映
昤
春
昧
昨
昫
昭
是
昱
昴
昵
昶
昺
昼
昿
晁
時
晃
晄
晈
晉
晋
晌
晏
晒
晙
晚
晛
晝
晞
晟
晡
晢
晣
晤
晦
晧
晨
晩
普
景
晰
晳
晴
晶
晷
智
晻
暁
暄
暇
暈
暉
暎
暐
暑
暖
暗
暘
暝
暠
暢
暦
暫
暮
暱
暲
暴
暸
暹
暼
暾
曁
曄
曆
曇
曈
曉
曖
曙
曚
曛
曜
曝
曠
曦
曩
曬
曰
曲
曳
更
曵
曷
書
曹
曺
曼
曽
曾
替
最
會
月
有
朋
服
朏
朐
朒
朔
朕
朗
朙
望
朝
朞
期
朦
朧
木
未
末
本
札
朮
朱
朳
朴
朶
朸
机
朽
朿
杁
杆
杇
杈
杉
杌
李
杏
材
村
杓
杖
杙
杜
杞
束
杠
条
杢
杣
杤
来
杦
杪
杭
杮
杯
杰
東
杲
杳
杵
杷
杻
杼
松
板
枇
枉
枋
枌
析
枒
枓
枕
林
枘
枚
枛
果
枝
枠
枡
枢
枩
枯
枰
枲
枳
枴
架
枷
枸
枹
枻
柀
柁
柃
柄
柊
柏
某
柑
染
柔
柘
柚
柝
柞
柢
柧
柩
柬
柮
柯
柰
柱
柳
柴
柵
柹
査
柾
柿
栂
栃
栄
栓
栖
栗
栝
栞
栟
校
栢
栩
株
栫
栭
栱
栲
栴
核
根
格
栽
桀
桁
桂
桃
桄
桅
框
案
桌
桍
桎
桐
桑
桓
桔
桕
桙
桛
桜
桝
桟
桧
桮
桲
桴
桵
桶
桷
桺
桿
梁
梃
梅
梍
梏
梓
梔
梖
梗
梛
條
梟
梠
梢
梣
梧
梨
梫
梭
梯
械
梱
梲
梳
梵
梶
梺
梼
棃
棄
棉
棊
棋
棍
棒
棕
棖
棗
棘
棚
棟
棠
棡
棣
棧
棬
棭
森
棰
棱
棲
棹
棺
棻
椀
椁
椃
椄
椅
椇
椈
椋
椌
植
椎
椏
椒
椙
椚
椛
検
椰
椴
椶
椹
椻
椽
椿
楂
楆
楉
楊
楓
楔
楕
楙
楚
楝
楞
楠
楡
楢
楣
楤
楨
楩
楪
楫
業
楮
楯
楲
楳
極
楷
楸
楹
楺
楼
楽
榀
榁
概
榊
榎
榑
榔
榕
榛
榜
榠
榥
榧
榭
榮
榱
榲
榴
榷
榺
榻
榼
榾
榿
槀
槁
槃
槇
槊
構
槌
槍
槎
槐
槓
槖
様
槙
槞
槧
槨
槩
槭
槲
槳
槴
槵
槶
槹
槻
槽
槿
樂
樅
樊
樋
樏
樒
樓
樔
樗
標
樛
樝
樞
樟
模
樣
権
横
樫
樴
樵
樸
樹
樺
樽
樾
樿
橄
橅
橇
橈
橋
橎
橐
橖
橘
橙
橛
機
橡
橢
橦
橫
橿
檀
檄
檉
檍
檎
檐
檑
檗
檜
檝
檞
檟
檠
檡
檢
檣
檥
檪
檫
檬
檮
檳
檸
檻
檽
櫁
櫂
櫃
櫓
櫔
櫚
櫛
櫝
櫞
櫟
櫧
櫨
櫪
櫬
櫱
櫲
櫳
櫺
櫻
櫽
欄
欅
權
欏
欒
欖
欛
欝
欞
欠
次
欣
欧
欬
欲
欵
欷
欸
欹
欺
欽
款
歃
歆
歇
歉
歌
歎
歐
歓
歔
歘
歙
歛
歟
歡
止
正
此
步
武
歧
歩
歪
歯
歳
歴
歷
歸
歹
死
歿
殀
殁
殂
殃
殄
殆
殉
殊
残
殍
殕
殖
殘
殛
殞
殤
殪
殫
殭
殮
殯
殱
殲
殴
段
殷
殺
殻
殼
殽
殿
毀
毅
毆
毉
毋
母
毎
每
毐
毒
毓
比
毖
毗
毘
毛
毟
毧
毫
毬
毮
毯
毱
毳
毿
氅
氈
氎
氏
氐
民
氓
气
気
氛
氣
氤
氳
水
氵
氷
永
氾
汀
汁
求
汎
汐
汕
汗
汙
汚
汜
汝
汞
江
池
汧
汨
汪
汭
汰
汲
汴
汶
決
汽
汾
沁
沂
沃
沅
沆
沈
沉
沌
沍
沐
沒
沓
沔
沕
沖
沙
沚
沛
沜
没
沢
沪
沫
沮
沱
河
沸
油
治
沼
沽
沾
沿
況
泄
泅
泆
泉
泊
泌
泐
泓
泔
法
泖
泗
泚
泛
泝
泠
泡
波
泣
泥
注
泪
泫
泬
泮
泯
泰
泳
洄
洊
洋
洌
洎
洒
洗
洙
洛
洞
洟
津
洦
洧
洩
洪
洫
洮
洱
洲
洳
洴
洵
洶
洸
洹
活
洼
洽
派
洿
流
浄
浅
浙
浚
浜
浞
浣
浤
浥
浦
浩
浪
浬
浮
浴
海
浸
浹
涂
涅
涇
消
涉
涌
涎
涓
涔
涕
涘
涙
涛
涜
涪
涯
液
涴
涵
涸
涼
涿
淀
淂
淄
淅
淆
淇
淋
淌
淏
淑
淒
淖
淘
淙
淚
淛
淝
淞
淡
淤
淦
淨
淪
淫
淬
淮
深
淳
淵
混
淸
淹
淺
添
淼
清
渇
済
渉
渋
渓
渕
渗
渙
渚
減
渝
渟
渠
渡
渣
渤
渥
渦
渧
温
渫
測
渭
港
渴
游
渺
渾
湃
湄
湊
湍
湎
湑
湓
湖
湗
湘
湛
湜
湟
湣
湧
湫
湮
湯
湲
湾
湿
満
溂
溌
溏
源
準
溘
溜
溝
溟
溢
溥
溧
溪
溫
溯
溱
溲
溶
溷
溺
溽
滁
滂
滃
滄
滅
滇
滉
滊
滋
滌
滎
滑
滓
滔
滕
滙
滝
滞
滬
滯
滲
滴
滷
滸
滹
滻
滾
滿
漁
漂
漆
漉
漏
漐
漑
漓
演
漕
漚
漠
漢
漣
漪
漫
漬
漱
漲
漳
漶
漸
漾
漿
潁
潅
潔
潘
潙
潚
潛
潜
潞
潟
潡
潢
潤
潦
潭
潮
潯
潰
潴
潸
潺
潼
澀
澁
澂
澄
澆
澈
澌
澍
澎
澑
澔
澗
澘
澠
澡
澣
澤
澥
澧
澪
澱
澳
澶
澹
激
濁
濂
濃
濈
濊
濕
濘
濛
濞
濟
濠
濡
濤
濫
濬
濮
濯
濰
濱
濳
濵
濶
濹
濺
濼
濾
瀁
瀆
瀉
瀋
瀏
瀑
瀕
瀘
瀚
瀛
瀝
瀞
瀟
瀣
瀦
瀧
瀨
瀬
瀰
瀲
瀹
瀼
瀾
灃
灊
灌
灑
灔
灘
灝
灞
灣
灤
灩
火
灯
灰
灵
灶
灸
灼
災
灾
炁
炅
炆
炉
炊
炎
炒
炕
炙
炤
炫
炬
炭
炮
炯
炳
炷
炸
点
為
炻
烈
烏
烘
烙
烝
烟
烤
烱
烹
烽
焃
焄
焉
焌
焔
焙
焚
焜
焠
無
焦
焮
焰
然
焼
煆
煉
煌
煎
煑
煒
煓
煕
煖
煙
煜
煞
煠
煢
煤
煥
煦
照
煨
煩
煬
煮
煽
熄
熅
熇
熈
熊
熏
熒
熔
熕
熖
熙
熟
熢
熨
熬
熮
熯
熱
熳
熹
熺
熾
燁
燃
燄
燈
燉
燋
燎
燐
燒
燔
燕
燗
營
燠
燥
燦
燧
燬
燭
燮
燵
燹
燻
燼
燾
燿
爀
爆
爇
爍
爐
爕
爛
爨
爪
爬
爭
爰
爲
爵
父
爹
爺
爻
爼
爽
爾
爿
牀
牂
牆
片
版
牋
牌
牒
牓
牕
牖
牘
牙
牛
牝
牟
牡
牢
牣
牧
物
牯
牲
牴
特
牽
牾
牿
犀
犁
犂
犇
犍
犎
犒
犖
犛
犠
犢
犧
犬
犭
犯
犱
状
狀
狁
狂
狃
狄
狆
狌
狎
狐
狒
狗
狙
狛
狠
狡
狢
狩
独
狭
狷
狸
狹
狺
狻
狼
狽
猇
猊
猖
猗
猙
猛
猜
猝
猟
猥
猧
猨
猩
猪
猫
猬
献
猯
猱
猳
猴
猶
猷
猹
猾
猿
獄
獅
獎
獏
獐
獒
獗
獠
獣
獦
獨
獪
獫
獮
獯
獰
獱
獲
獵
獷
獸
獺
獻
獼
玁
玄
玅
率
玉
王
玕
玖
玘
玠
玢
玦
玨
玩
玫
玲
玳
玵
玷
玻
珀
珂
珈
珉
珊
珍
珎
珏
珙
珞
珠
珣
珥
珧
珩
珪
班
珮
珸
現
球
琅
理
琇
琉
琊
琚
琛
琢
琤
琥
琦
琨
琪
琬
琮
琯
琰
琲
琳
琴
琵
琶
琹
琺
琿
瑀
瑁
瑄
瑇
瑋
瑒
瑕
瑗
瑙
瑚
瑛
瑜
瑞
瑟
瑠
瑣
瑤
瑩
瑪
瑫
瑯
瑰
瑱
瑳
瑶
瑾
璁
璃
璅
璆
璇
璉
璋
璐
璘
璜
璞
璟
璠
璡
璣
璧
璨
璩
璪
璫
環
璵
璽
璿
瓈
瓊
瓌
瓏
瓔
瓘
瓚
瓜
瓠
瓢
瓣
瓦
瓩
瓫
瓮
瓰
瓱
瓲
瓶
瓷
瓺
瓿
甃
甄
甌
甍
甎
甑
甓
甕
甘
甚
甜
甞
生
產
産
甤
甥
甦
用
甪
甫
甯
田
由
甲
申
男
甸
町
画
畀
畄
畆
畊
畋
界
畎
畏
畑
畔
留
畚
畛
畜
畝
畠
畢
畤
略
畦
畧
番
畫
畬
畯
異
畱
畳
當
畷
畸
畹
畾
畿
疂
疆
疇
疉
疊
疋
疎
疏
疑
疒
疔
疚
疝
疢
疣
疥
疫
疱
疲
疳
疵
疷
疸
疹
疼
疽
疾
痀
痂
痃
病
痆
症
痊
痍
痎
痒
痔
痕
痘
痙
痛
痞
痢
痣
痤
痩
痬
痰
痲
痳
痴
痹
痺
痼
痾
痿
瘀
瘁
瘂
瘃
瘇
瘉
瘋
瘍
瘓
瘕
瘖
瘙
瘞
瘟
瘠
瘡
瘢
瘤
瘥
瘦
瘧
瘭
瘰
瘳
瘴
瘵
瘻
療
癃
癆
癇
癈
癉
癋
癌
癒
癖
癘
癡
癢
癤
癥
癧
癩
癪
癬
癭
癮
癯
癰
癱
癲
癸
発
登
發
白
百
皀
皁
皃
的
皆
皇
皈
皋
皎
皐
皓
皖
皙
皚
皛
皝
皡
皦
皪
皮
皰
皴
皷
皸
皹
皺
皿
盂
盃
盆
盈
益
盌
盍
盎
盒
盔
盖
盗
盛
盜
盞
盟
盡
監
盤
盥
盧
盪
目
盱
盲
直
相
盻
盼
盾
省
眄
眇
眈
眉
眊
看
県
眗
眙
眛
眞
真
眠
眤
眥
眦
眩
眭
眴
眵
眶
眷
眸
眺
眼
着
睇
睎
睚
睛
睜
睟
睡
睢
督
睥
睦
睨
睪
睫
睲
睹
睺
睼
睽
睾
睿
瞋
瞎
瞑
瞚
瞞
瞟
瞠
瞢
瞤
瞥
瞪
瞬
瞭
瞰
瞳
瞶
瞹
瞻
瞼
瞽
瞿
矇
矍
矗
矚
矛
矜
矟
矠
矢
矣
知
矦
矧
矩
矪
短
矮
矯
矰
石
矻
矼
砂
砆
砉
砌
砍
砒
研
砕
砡
砥
砦
砧
砬
砭
砲
破
砺
砿
硃
硅
硎
硝
硤
硨
硫
硬
确
硯
硲
硼
碁
碇
碌
碍
碎
碑
碓
碔
碕
碗
碟
碣
碧
碩
碪
碭
碯
碰
確
碼
碾
磁
磅
磈
磊
磋
磌
磎
磐
磑
磔
磕
磚
磠
磤
磧
磨
磬
磯
磲
磴
磷
磻
磽
磾
礀
礁
礎
礑
礒
礙
礜
礦
礪
礫
礬
礮
礱
礴
示
礼
礽
社
祀
祁
祅
祆
祇
祈
祉
祊
祐
祓
祕
祖
祗
祚
祜
祝
神
祟
祠
祢
祥
祧
票
祭
祲
祷
祺
祿
禀
禁
禄
禅
禊
禍
禎
福
禕
禘
禛
禝
禦
禧
禪
禮
禰
禱
禳
禴
禹
禺
离
禽
禾
禿
秀
私
秇
秈
秉
秋
秌
种
科
秒
秔
秕
秘
租
秣
秤
秦
秧
秩
秫
秬
秭
称
移
稀
稃
稈
稊
程
稍
税
稑
稔
稗
稙
稚
稛
稜
稟
稠
稭
種
稱
稲
稷
稹
稻
稼
稽
稾
稿
穀
穂
穆
穉
積
穎
穏
穗
穠
穡
穢
穣
穩
穪
穫
穭
穰
穴
穵
究
穹
空
穽
穿
突
窂
窃
窄
窅
窈
窒
窓
窕
窖
窗
窘
窟
窠
窣
窩
窪
窬
窮
窯
窳
窶
窹
窺
窻
窼
窿
竃
竄
竅
竇
竈
竊
立
竑
竒
竕
站
竜
竝
竟
章
竢
竣
童
竦
竪
竭
端
竴
競
竸
竹
竺
竽
竿
笄
笆
笇
笈
笊
笋
笏
笑
笘
笙
笛
笞
笠
笥
符
笧
笨
第
笭
笮
笯
笳
笵
笶
笹
笻
筅
筆
筇
筈
等
筋
筌
筍
筏
筐
筑
筒
答
策
筝
筠
筥
筧
筩
筬
筭
筮
筯
筰
筱
筲
筵
筺
箆
箇
箋
箍
箏
箑
箒
箔
箕
算
箙
箚
箛
箜
箝
管
箪
箭
箯
箱
箴
箵
箸
節
篁
範
篆
篇
築
篋
篌
篏
篔
篗
篙
篚
篝
篠
篤
篥
篦
篩
篪
篭
篳
篶
篷
簀
簁
簃
簇
簋
簍
簎
簑
簒
簓
簔
簗
簞
簟
簠
簡
簣
簦
簧
簪
簫
簱
簳
簶
簷
簸
簽
簾
簿
籀
籃
籊
籌
籍
籏
籐
籑
籔
籖
籘
籙
籟
籠
籤
籥
籩
籬
籮
籰
米
籹
籾
粁
粂
粃
粉
粋
粍
粏
粒
粔
粕
粗
粘
粛
粟
粡
粢
粤
粥
粦
粧
粮
粱
粲
粳
粹
粼
粽
精
糀
糂
糅
糈
糊
糍
糎
糒
糕
糖
糙
糜
糝
糞
糟
糠
糢
糧
糫
糯
糲
糴
糶
糸
糺
系
糾
紀
紂
約
紅
紆
紇
紈
紉
紊
紋
納
紐
紒
紓
純
紕
紗
紘
紙
級
紛
紜
紝
素
紡
索
紫
紬
紮
累
細
紱
紲
紳
紵
紹
紺
紿
絀
絁
終
絃
組
絅
絆
絋
経
絎
絏
結
絓
絖
絛
絜
絞
絡
絢
絣
給
絨
絮
絰
統
絲
絳
絵
絶
絹
絺
絽
絿
綃
綆
綈
綉
綏
經
継
続
綛
綜
綝
綟
綠
綢
綣
綦
綫
綬
維
綮
綯
綰
綱
網
綴
綵
綷
綸
綺
綻
綽
綾
綿
緂
緇
緊
緋
緌
総
緑
緒
緖
緗
緘
線
緜
緝
緞
締
緡
緣
緦
編
緩
緬
緯
緱
緲
練
緻
縁
縄
縅
縈
縉
縊
縋
縐
縑
縒
縕
縗
縛
縝
縞
縟
縡
縢
縣
縦
縧
縫
縬
縮
縯
縱
縲
縵
縷
縹
縺
縻
總
績
繁
繃
繅
繆
繇
繊
繋
繍
繒
織
繕
繖
繙
繚
繝
繞
繡
繦
繧
繩
繪
繫
繭
繰
繵
繹
繻
繼
繽
繾
繿
纂
纃
纆
纇
纈
纉
纊
續
纍
纎
纏
纐
纑
纒
纓
纔
纖
纘
纚
纛
纜
红
级
线
缶
缸
缺
缻
缼
缾
罃
罄
罅
罇
罌
罍
罎
罏
罐
网
罔
罕
罘
罟
罠
罡
罣
罨
罩
罪
罫
置
罰
署
罵
罷
罸
罹
罽
罾
羂
羃
羅
羆
羇
羈
羊
羋
羌
美
羑
羔
羗
羚
羝
羞
羣
群
羨
義
羮
羯
羲
羶
羸
羹
羽
羿
翁
翃
翅
翆
翊
翌
翎
習
翔
翕
翛
翟
翠
翡
翣
翥
翦
翩
翫
翬
翮
翰
翳
翹
翺
翻
翼
耀
老
耂
考
耄
者
耆
耊
耋
而
耎
耐
耑
耒
耕
耗
耘
耙
耜
耡
耦
耨
耬
耰
耳
耵
耶
耻
耼
耽
耿
聃
聆
聊
聒
聖
聘
聚
聞
聟
聡
聢
聨
聯
聰
聱
聲
聳
聴
聵
聶
職
聹
聻
聽
聾
聿
肄
肅
肆
肇
肉
肋
肌
肓
肖
肘
肚
肛
肜
肝
股
肢
肥
肩
肪
肭
肯
肱
育
肴
肸
肺
胃
胄
胆
胊
背
胎
胖
胙
胚
胛
胝
胞
胠
胡
胤
胥
胯
胱
胳
胴
胸
胼
能
脂
脅
脆
脇
脈
脉
脊
脖
脚
脛
脞
脣
脧
脩
脬
脯
脱
脳
脹
脽
脾
腆
腊
腋
腎
腐
腑
腓
腔
腕
腟
腠
腥
腦
腫
腭
腮
腰
腱
腴
腸
腹
腺
腿
膀
膁
膂
膃
膄
膅
膈
膊
膏
膓
膕
膚
膜
膝
膠
膣
膨
膩
膳
膵
膸
膺
膻
膽
膾
膿
臀
臁
臂
臆
臈
臉
臊
臍
臏
臑
臓
臗
臘
臙
臚
臟
臠
臣
臥
臧
臨
自
臬
臭
至
致
臺
臻
臼
臾
舁
舂
舄
舅
與
興
舉
舊
舌
舍
舎
舐
舒
舖
舗
舘
舛
舜
舞
舟
舢
舩
航
舫
般
舲
舳
舵
舶
舷
舸
船
舼
艀
艅
艇
艏
艗
艘
艙
艟
艣
艤
艦
艨
艪
艫
艮
良
艱
色
艴
艶
艷
艸
艾
芊
芋
芍
芎
芒
芙
芝
芟
芡
芣
芥
芦
芫
芬
芭
芮
芯
花
芳
芷
芸
芹
芻
芼
芽
芾
芿
苅
苆
苑
苒
苓
苔
苕
苗
苛
苜
苞
苟
苡
苢
苣
若
苦
苧
苫
英
苳
苴
苹
苺
苻
苽
苾
茀
茁
茂
范
茄
茅
茆
茉
茎
茖
茗
茘
茛
茜
茝
茣
茨
茫
茭
茯
茰
茱
茲
茴
茵
茶
茸
茹
茺
荀
荃
荅
荇
草
荊
荏
荐
荑
荒
荔
荘
荳
荵
荷
荻
荼
荽
莅
莆
莇
莉
莊
莎
莒
莓
莖
莘
莚
莝
莞
莟
莠
莢
莧
莨
莩
莪
莫
莱
莵
莽
莿
菀
菁
菅
菉
菊
菌
菎
菐
菑
菓
菔
菖
菘
菜
菝
菟
菠
菡
菩
菪
菫
華
菰
菱
菲
菴
菷
菹
菻
菽
萁
萃
萄
萆
萇
萊
萋
萌
萍
萎
萏
萓
萠
萢
萩
萬
萱
萵
萸
萼
落
葆
葉
葊
葎
葒
著
葙
葛
葜
葡
葢
董
葦
葩
葫
葬
葭
葮
葯
葰
葱
葳
葵
葶
葷
葺
蒂
蒄
蒅
蒋
蒐
蒔
蒙
蒜
蒞
蒟
蒡
蒭
蒯
蒲
蒴
蒸
蒹
蒻
蒼
蒾
蒿
蓀
蓁
蓂
蓄
蓆
蓉
蓊
蓋
蓍
蓏
蓐
蓑
蓓
蓖
蓙
蓚
蓧
蓬
蓮
蓯
蓰
蓴
蓺
蓼
蓿
蔀
蔌
蔑
蔓
蔔
蔕
蔗
蔘
蔚
蔞
蔟
蔡
蔣
蔤
蔦
蔫
蔬
蔭
蔯
蔲
蔴
蔵
蔽
蕀
蕁
蕃
蕈
蕉
蕊
蕋
蕎
蕑
蕓
蕕
蕗
蕘
蕙
蕚
蕞
蕣
蕤
蕨
蕩
蕪
蕭
蕷
蕺
蕾
薀
薁
薄
薇
薈
薊
薌
薏
薐
薑
薔
薗
薙
薛
薜
薢
薤
薦
薨
薩
薪
薫
薬
薭
薮
薯
薰
薷
薹
薺
薼
藁
藉
藊
藋
藍
藎
藏
藐
藕
藜
藝
藟
藤
藥
藩
藪
藶
藷
藹
藺
藻
藿
蘂
蘄
蘅
蘆
蘇
蘊
蘋
蘐
蘓
蘖
蘗
蘘
蘚
蘞
蘡
蘧
蘩
蘭
蘯
蘰
蘸
蘼
蘿
虀
虁
虍
虎
虐
虓
虔
處
虖
虗
虚
虛
虜
虞
號
虢
虧
虫
虬
虯
虱
虵
虹
虺
虻
蚊
蚋
蚌
蚑
蚓
蚕
蚘
蚜
蚝
蚣
蚤
蚨
蚩
蚪
蚫
蚯
蚰
蚱
蚵
蚶
蚸
蛁
蛄
蛆
蛇
蛉
蛋
蛍
蛎
蛔
蛗
蛙
蛛
蛞
蛟
蛤
蛦
蛩
蛬
蛭
蛮
蛯
蛸
蛹
蛺
蛻
蛼
蛾
蜀
蜂
蜃
蜆
蜇
蜈
蜉
蜊
蜋
蜍
蜎
蜐
蜑
蜒
蜓
蜘
蜙
蜚
蜜
蜡
蜣
蜥
蜩
蜴
蜷
蜺
蜻
蜾
蜿
蝀
蝉
蝋
蝌
蝎
蝓
蝕
蝗
蝘
蝙
蝟
蝠
蝣
蝤
蝥
蝦
蝨
蝪
蝮
蝱
蝲
蝴
蝶
蝸
蝼
蝿
螂
螇
螈
融
螓
螟
螠
螢
螫
螬
螭
螯
螳
螺
螻
螽
蟀
蟄
蟆
蟇
蟋
蟒
蟖
蟟
蟠
蟣
蟪
蟫
蟬
蟭
蟯
蟲
蟵
蟶
蟷
蟹
蟻
蟾
蠁
蠃
蠅
蠆
蠊
蠋
蠍
蠎
蠐
蠑
蠕
蠖
蠟
蠡
蠢
蠣
蠧
蠨
蠱
蠲
蠶
蠹
蠻
血
衂
衄
衆
衊
行
衍
衒
術
街
衙
衛
衝
衞
衡
衢
衣
表
衫
衰
衲
衵
衷
衽
衾
衿
袁
袂
袈
袋
袍
袒
袖
袗
袘
袙
袞
袢
袤
袪
被
袮
袰
袱
袴
袵
袷
袼
袿
裀
裁
裂
裃
裄
装
裊
裎
裏
裑
裒
裔
裕
裘
裙
裛
補
裝
裟
裡
裨
裰
裱
裲
裳
裴
裵
裸
裹
裼
製
裾
褁
褂
褄
複
褊
褌
褐
褒
褓
褘
褙
褚
褝
褞
褥
褪
褫
褰
褲
褶
褸
褹
褻
襀
襁
襃
襄
襅
襌
襍
襖
襞
襟
襠
襤
襦
襪
襯
襲
襴
襷
襾
西
要
覃
覆
覇
覈
覉
覊
見
規
覓
覔
視
覗
覘
覚
覡
覦
覧
覩
親
覬
覯
覰
覲
観
覺
覽
覿
觀
视
角
觔
觚
觜
觝
解
觥
触
觧
觫
觱
觳
觴
觸
言
訂
訃
計
訊
訌
討
訐
訒
訓
訕
訖
託
記
訛
訝
訟
訢
訣
訥
訪
設
許
訳
訴
訶
診
註
証
訾
詁
詆
詈
詎
詐
詑
詒
詔
評
詘
詛
詞
詠
詡
詢
詣
試
詧
詩
詫
詬
詭
詮
詰
話
該
詳
詵
詹
詼
誂
誄
誅
誇
誉
誌
認
誐
誑
誓
誕
誘
誚
語
誠
誡
誣
誤
誥
誦
誨
說
説
読
誰
課
誹
誼
誾
調
諂
諄
談
請
諌
諍
諏
諐
諒
論
諗
諚
諛
諜
諝
諠
諡
諢
諤
諦
諧
諫
諭
諮
諱
諳
諶
諷
諸
諺
諼
諾
謀
謁
謂
謄
謇
謊
謌
謎
謐
謔
謖
謗
謙
謚
講
謝
謟
謠
謡
謦
謨
謫
謬
謭
謳
謹
謾
譁
譃
證
譌
譎
譏
譔
譖
識
譙
譚
譜
譟
警
譫
譬
譯
議
譲
譴
護
譽
讀
讃
變
讋
讌
讎
讐
讒
讓
讕
讖
讙
讚
讜
谷
谺
谽
谿
豁
豆
豇
豈
豉
豊
豌
豎
豐
豔
豕
豚
象
豢
豨
豪
豫
豬
豭
豳
豸
豹
豺
豼
貂
貅
貉
貊
貌
貍
貎
貓
貔
貘
貙
貛
貝
貞
負
財
貢
貧
貨
販
貪
貫
責
貮
貯
貰
貲
貳
貴
貶
買
貸
費
貼
貽
貿
賀
賁
賂
賃
賄
資
賈
賊
賍
賎
賑
賓
賖
賚
賛
賜
賞
賠
賡
賢
賣
賤
賦
質
賭
賴
賸
賺
賻
購
賽
贄
贅
贇
贈
贊
贋
贍
贏
贐
贓
贔
贖
贛
赛
赤
赦
赧
赫
赭
走
赱
赳
赴
起
趁
趄
超
越
趕
趙
趣
趦
趨
足
趺
趾
跂
跆
跈
跋
跌
跎
跏
跑
跖
跗
跙
跚
跛
距
跟
跡
跣
跨
跪
跫
跬
路
跳
践
跼
踈
踉
踊
踌
踏
踐
踔
踖
踝
踞
踟
踠
踢
踣
踪
踰
踴
踵
踶
踽
蹂
蹄
蹇
蹈
蹉
蹊
蹋
蹌
蹐
蹕
蹙
蹟
蹠
蹣
蹤
蹬
蹭
蹯
蹰
蹲
蹴
蹶
蹻
蹼
躁
躄
躅
躇
躊
躋
躍
躑
躓
躔
躙
躡
躪
身
躬
躯
躰
躱
躶
躾
軀
軆
軈
車
軋
軌
軍
軒
軔
軕
軛
軟
転
軫
軸
軹
軺
軻
軼
軽
軾
較
輅
輈
載
輊
輌
輒
輓
輔
輕
輗
輙
輛
輜
輝
輞
輟
輦
輩
輪
輫
輭
輯
輳
輶
輸
輻
輾
輿
轀
轂
轄
轅
轆
轉
轌
轍
轎
轔
轗
轘
轜
轟
轡
轢
轣
轤
车
辛
辜
辞
辟
辣
辦
辧
辨
辭
辮
辯
辰
辱
農
辴
辵
辶
辷
辺
辻
込
辿
迁
迂
迄
迅
迍
迎
运
近
迓
返
迕
迚
迠
迢
迤
迥
迦
迨
迩
迪
迫
迭
迯
述
迱
迴
迵
迷
迸
迹
迺
迻
追
退
送
适
逃
逅
逆
逈
逋
逍
逎
透
逐
逑
逓
途
逕
逖
逗
這
通
逝
逞
速
造
逡
逢
連
逭
逮
週
進
逵
逶
逸
逹
逼
逾
遁
遂
遄
遅
遇
遉
遊
運
遍
過
遏
遐
遑
遒
道
達
違
遖
遘
遙
遜
遝
遞
遠
遡
遣
遥
遨
適
遭
遮
遯
遲
遵
遶
遷
選
遹
遺
遼
遽
避
邀
邁
邂
邃
還
邅
邇
邈
邉
邊
邌
邏
邑
邕
邙
邠
邢
那
邦
邨
邪
邯
邱
邳
邵
邶
邸
邽
邾
郁
郃
郄
郅
郈
郊
郎
郗
郛
郝
郞
郡
郢
郤
部
郭
郯
郵
郷
都
郿
鄂
鄄
鄆
鄒
鄔
鄖
鄘
鄙
鄜
鄞
鄢
鄣
鄧
鄭
鄯
鄰
鄱
鄲
鄴
鄹
鄽
酆
酈
酉
酊
酋
酌
配
酎
酒
酔
酖
酘
酙
酛
酡
酢
酣
酤
酥
酩
酪
酬
酲
酳
酴
酵
酷
酸
酹
醂
醃
醅
醇
醉
醋
醍
醎
醐
醒
醗
醜
醞
醢
醤
醨
醪
醫
醬
醮
醯
醴
醵
醶
醸
醺
醼
釀
釁
釃
釄
釆
采
釈
釉
釋
里
重
野
量
釐
金
釗
釘
釛
釜
針
釣
釦
釧
釭
釱
釵
釼
釿
鈇
鈍
鈎
鈐
鈑
鈔
鈕
鈞
鈴
鈷
鈸
鈹
鈺
鈿
鉄
鉅
鉈
鉉
鉋
鉏
鉐
鉗
鉛
鉞
鉢
鉤
鉦
鉱
鉸
鉾
銀
銃
銅
銈
銍
銑
銓
銕
銖
銘
銚
銛
銜
銭
銷
銹
鋋
鋌
鋏
鋒
鋠
鋤
鋩
鋪
鋭
鋲
鋳
鋸
鋹
鋺
鋼
錂
錄
錆
錏
錐
錑
錕
錘
錙
錚
錞
錠
錡
錢
錣
錦
錧
錨
錫
錬
錮
錯
録
錵
錺
錻
鍇
鍈
鍊
鍋
鍍
鍑
鍔
鍗
鍛
鍜
鍠
鍤
鍪
鍫
鍬
鍮
鍰
鍵
鍼
鍾
鎌
鎔
鎖
鎗
鎚
鎛
鎧
鎬
鎭
鎮
鎰
鎹
鎺
鏁
鏃
鏇
鏈
鏐
鏑
鏖
鏗
鏘
鏜
鏝
鏞
鏟
鏡
鏢
鏤
鏨
鏽
鐃
鐉
鐐
鐔
鐖
鐘
鐙
鐚
鐡
鐫
鐲
鐵
鐶
鐸
鐺
鐻
鑁
鑄
鑊
鑑
鑒
鑓
鑚
鑛
鑞
鑠
鑢
鑣
鑪
鑫
鑰
鑱
鑲
鑵
鑷
鑼
鑽
鑾
鑿
钁
铁
長
长
門
閂
閃
閇
閉
閊
開
閎
閏
閑
閒
間
閔
閖
閘
閙
閟
閠
関
閣
閤
閥
閦
閧
閨
閩
閫
閬
閭
閲
閴
閶
閹
閻
閼
閽
閾
闃
闇
闈
闊
闋
闌
闍
闐
闓
闔
闕
闖
闘
闚
關
闞
闡
闢
闥
阜
阡
阨
阪
阬
阮
阯
防
阳
阴
阻
阼
阿
陀
陁
陂
附
陋
陌
降
限
陕
陘
陛
陜
陝
陞
陟
陡
院
陣
除
陥
陪
陬
陰
陲
陳
陵
陶
陷
陸
険
陽
隂
隄
隅
隆
隈
隊
隋
隍
階
随
隔
隕
隗
隘
隙
際
障
隠
隣
隤
隥
隧
隨
隩
險
隰
隱
隲
隳
隴
隷
隸
隹
隻
隼
雀
雁
雄
雅
集
雇
雉
雋
雌
雍
雎
雑
雒
雕
雖
雘
雙
雚
雛
雜
雝
雞
離
難
雨
雩
雪
雫
雰
雲
零
雷
雹
電
需
霄
霆
震
霊
霍
霎
霏
霑
霓
霖
霙
霜
霞
霤
霧
霰
露
霸
霹
霽
霾
靂
靄
靆
靇
靈
靉
靏
青
靖
静
靚
靛
靜
非
靠
靡
面
靦
靨
革
靫
靭
靮
靱
靳
靴
靹
靺
靼
鞁
鞄
鞅
鞆
鞋
鞍
鞏
鞐
鞘
鞜
鞞
鞠
鞢
鞣
鞦
鞨
鞫
鞬
鞭
鞮
鞱
鞳
鞴
鞺
鞾
韁
韃
韆
韈
韉
韋
韌
韑
韓
韔
韙
韛
韜
韞
韡
韭
韮
韲
音
韵
韶
韻
響
頁
頂
頃
頄
項
順
須
頊
頌
頎
頏
預
頑
頒
頓
頗
領
頚
頞
頠
頡
頣
頤
頥
頫
頬
頭
頰
頳
頴
頷
頸
頻
頼
頽
顆
顇
顋
題
額
顎
顏
顒
顓
顔
顕
顖
顗
願
顙
顚
顛
類
顥
顧
顫
顬
顯
顰
顱
顳
顴
風
颪
颯
颰
颱
颶
颷
颸
颺
颼
颿
飂
飃
飄
飆
飇
飈
飛
飜
食
飡
飢
飧
飩
飪
飫
飭
飮
飯
飱
飲
飴
飼
飽
飾
餃
餅
餈
餉
養
餌
餐
餒
餓
餔
餘
餛
餝
餞
餠
餡
餤
館
餬
餮
餲
餻
餼
餽
餾
饀
饂
饅
饉
饋
饌
饍
饐
饑
饒
饕
饗
饘
饜
首
馗
馘
香
馥
馨
馬
馭
馮
馳
馴
馽
駁
駃
駄
駅
駆
駈
駉
駐
駑
駒
駔
駕
駘
駙
駛
駝
駞
駟
駢
駭
駮
駱
駸
駻
駼
駿
騁
騂
騃
騅
騊
騎
騏
騒
験
騖
騙
騠
騨
騫
騭
騮
騰
騱
騶
騷
騸
騾
驀
驂
驃
驄
驅
驊
驍
驎
驕
驗
驚
驛
驟
驢
驤
驥
驩
驪
驫
骨
骭
骯
骰
骶
骸
骼
髀
髄
髏
髐
髑
髒
髓
體
高
髙
髞
髟
髠
髢
髣
髥
髦
髩
髪
髫
髭
髮
髯
髱
髴
髷
髹
髻
鬂
鬃
鬆
鬐
鬒
鬖
鬘
鬚
鬟
鬢
鬣
鬧
鬨
鬩
鬪
鬬
鬭
鬮
鬯
鬱
鬲
鬻
鬼
魁
魂
魃
魄
魅
魋
魍
魎
魏
魑
魔
魘
魚
魞
魣
魥
魦
魯
魳
魴
魵
鮃
鮄
鮎
鮏
鮑
鮒
鮓
鮗
鮞
鮟
鮠
鮧
鮨
鮪
鮫
鮭
鮮
鮴
鮹
鮾
鯀
鯁
鯇
鯉
鯊
鯎
鯏
鯑
鯒
鯔
鯖
鯘
鯛
鯡
鯢
鯣
鯤
鯥
鯨
鯪
鯰
鯱
鯵
鯷
鯸
鯽
鰆
鰈
鰉
鰊
鰌
鰍
鰐
鰒
鰓
鰔
鰕
鰛
鰡
鰤
鰥
鰩
鰭
鰮
鰯
鰰
鰱
鰲
鰶
鰷
鰹
鰺
鰻
鰾
鱁
鱇
鱈
鱏
鱐
鱒
鱓
鱗
鱘
鱚
鱛
鱝
鱠
鱣
鱧
鱩
鱮
鱲
鱵
鱶
鱷
鱸
鱺
鳥
鳧
鳩
鳬
鳰
鳲
鳳
鳴
鳶
鴂
鴃
鴆
鴇
鴈
鴉
鴎
鴑
鴒
鴕
鴗
鴛
鴝
鴞
鴟
鴣
鴦
鴨
鴪
鴫
鴬
鴻
鴾
鴿
鵂
鵄
鵆
鵇
鵈
鵐
鵑
鵒
鵙
鵜
鵝
鵞
鵠
鵡
鵣
鵩
鵬
鵯
鵰
鵲
鵶
鵷
鵺
鵼
鶇
鶉
鶊
鶍
鶏
鶙
鶚
鶡
鶤
鶩
鶫
鶬
鶯
鶲
鶴
鶵
鶸
鶹
鶺
鶻
鶽
鶿
鷀
鷁
鷂
鷄
鷇
鷉
鷓
鷖
鷗
鷙
鷟
鷦
鷧
鷭
鷯
鷲
鷴
鷸
鷹
鷺
鷽
鸂
鸇
鸊
鸕
鸚
鸛
鸝
鸞
鹵
鹸
鹹
鹽
鹿
麁
麈
麋
麌
麑
麒
麓
麕
麗
麛
麝
麞
麟
麤
麥
麦
麨
麩
麪
麬
麭
麵
麸
麹
麺
麻
麼
麽
麾
麿
黃
黄
黌
黍
黎
黏
黐
黑
黒
黔
默
黙
黛
黜
黝
點
黠
黥
黧
黨
黮
黯
黴
黶
黷
黻
黼
黽
黿
鼂
鼇
鼈
鼎
鼐
鼓
鼕
鼙
鼠
鼡
鼬
鼯
鼷
鼹
鼻
鼾
齁
齅
齆
齊
齋
齎
齒
齓
齔
齕
齝
齟
齠
齡
齢
齣
齦
齧
齪
齬
齮
齰
齲
齶
齷
龍
龐
龔
龕
龗
龙
龜
龝
龠
欄
廊
朗
虜
類
﨏
塚
﨑
凞
猪
神
祥
福
﨟
諸
都
侮
僧
勉
勤
卑
嘆
器
墨
層
悔
憎
懲
敏
暑
梅
海
渚
漢
煮
琢
碑
社
祉
祈
祐
祖
祝
禍
禎
穀
突
節
練
繁
署
者
臭
著
視
謁
謹
賓
贈
逸
難
響
﹅
﹆
！
＃
＄
％
＆
（
）
＊
＋
，
－
．
／
０
１
２
３
４
５
６
７
８
９
：
；
＜
＝
＞
？
＠
Ａ
Ｂ
Ｃ
Ｄ
Ｅ
Ｆ
Ｇ
Ｈ
Ｉ
Ｊ
Ｋ
Ｌ
Ｍ
Ｎ
Ｏ
Ｐ
Ｑ
Ｒ
Ｓ
Ｔ
Ｕ
Ｖ
Ｗ
Ｘ
Ｙ
Ｚ
［
＼
］
＿
ａ
ｂ
ｃ
ｄ
ｅ
ｆ
ｇ
ｈ
ｉ
ｊ
ｋ
ｌ
ｍ
ｎ
ｏ
ｐ
ｑ
ｒ
ｓ
ｔ
ｕ
ｖ
ｗ
ｘ
ｙ
ｚ
｛
｜
｝
～
｟
｠
｡
｢
｣
､
･
￠
￡
￣
￥
𠈓
𠠇
𠮟
𠵅
𠹤
𠹭
𠺕
𡉕
𡸴
𡽶
𢈘
𢌞
𢪸
𢮦
𣏓
𣏕
𣑊
𣑥
𣜌
𣠽
𣱿
𣵀
𣷓
𤄃
𤢖
𤭖
𤹪
𥁕
𥇥
𥉌
𥶡
𥻘
𥿻
𦙾
𦣝
𦥯
𧄍
𧏛
𧘔
𧘕
𧜎
𧦅
𧮾
𧲸
𨋳
𨏍
𨗉
𨫤
𨸶
𨿸
𩛰
𩜙
𩺊
𩻩
𪘂
